{
    "url": "https://www.vinegret.cz/653543/v-prage-fanaty-rammstein-potoptali-posevy-svekly-ushcherb-200-tys-kron",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Concerts of the legendary German band Rammstein in Prague resulted in significant losses for the agricultural company VIN Agro. Fans of the band trampled a field planted with sugar beets. The producer estimated the damage at 100-200 thousand crowns.",
        "The concerts took place on May 15 and 16 in the open air on the territory of the Letnyany airfield in the district of the same name. The organizers fenced off the area within strictly defined boundaries so that it did not encroach on the adjacent agricultural field.",
        "However, there were people who, for some reason, couldn't attend the concert and decided to listen to their favorite band for free. They lined up along the fence and trampled the seedlings.",
        "\"Do you like Rammstein? The recent Prague concerts of this band have certainly become a big event and have given a lot of impressions to the visitors, but not to the company VIN agro. Their fields in Letňany were taken over by heated fans who didn't have tickets to the concert - they completely destroyed the sugar beet crop. It is very likely that they don't care about it. What's the point of worrying about the field when everything can be bought at the supermarket?! Big dislike from us. Obviously, this is a reflection of modern society and its views on agriculture,\" said the Czech Agrarian Chamber.",
        "The affected company turned to the police, but they were told that they would have to find each guilty fan, determine which section specifically they trampled on, and establish the amount of damage caused personally. Not only is it extremely problematic to track down all the guilty parties, but the amount of damage for each case will also be insufficient for legal action.",
        "\"Before the concert, we contacted the organizers to come up with a joint approach to prevent this situation, but our request went unanswered. We thought that coming to the venue and defending our field ourselves would be an unsuccessful idea, as it could lead to conflict. Therefore, we decided to continue along the path that we have been following for the past 30 years of farming in Prague and its surroundings, which we consider to be the most effective - showing and explaining the realities of agriculture to the public in a calm and acceptable manner. It is happening slowly, but we see some changes,\" VIN Agro stated.",
        "Subscribe to our Telegram channel, news comes out faster there.",
        "© 2014-2025 vinegret.cz"
    ]
}