{
    "url": "https://www.vinegret.cz/698287/babish-khochet-vvesti-100-nalog-na-pokupku-nedvizhimosti-dlia-inostrantsev-ne-iz-es",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Former Prime Minister of the Czech Republic and leader of the ANO party, Andrej Babis, stated in an interview with the portal Echo24 on Thursday, January 16, that if successful in the parliamentary elections and coming to power, he will introduce a 100% tax on real estate purchases for non-resident foreigners from the European Union who permanently reside outside the country.",
        "The politician was inspired by the example of Spain, where the government developed a similar bill aimed at tackling the housing crisis.",
        "\"In the country, there are too many AirBnBs and too little living space. Only in 2023, 27,000 houses and apartments in Spain were bought by non-EU residents. Not to live in them, but to speculate and make money.\"",
        "\"We cannot afford this in conditions of housing shortage. The West faces a crucial challenge: not to become a society divided into two classes - wealthy homeowners and poor tenants,\" said the head of the Spanish government Pedro Sanchez recently, adding that this step is aimed at providing affordable housing for people who truly want to live in Spain.",
        "Andrey Babis shares this position in relation to the Czech Republic, which is also experiencing a severe housing crisis, especially in large cities.",
        "\"Although I do not agree with the Spanish Prime Minister on many issues, here, in my opinion, he had a good idea that I really like. If we are in the government, I will insist that we take similar measures here.\"",
        "I emphasize that we are talking about people who are not from the European Union, more precisely, do not live in the EU. In my opinion, this should apply not only to houses or apartments, but also to land, because these people often buy up land plots, often with dubious capital,\" Babis said in an interview with Echo24.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}