{
    "url": "https://www.vinegret.cz/647833/V-Prage-otkrylsia-luna-park-Matejska-pout-2023",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Saturday morning, February 25th, the annual seasonal amusement park Matějská pouť opened on the premises of the Prague Exhibition Grounds (Výstaviště). It will be open until April 10th.",
        "The organizers brought around 115 different attractions from all over the Czech Republic, the Netherlands, Germany, and other countries for the thrill-seekers in the capital. Among them are a 50-meter Ferris wheel with heated cabins and new roller coasters from America.",
        "One third of the attractions are designed for children under 10 years old.",
        "The organizers have once again designated a special day (March 27) when all attractions will be available for free to people with disabilities (with TP, ZTP, or ZTP/P certificates) and orphaned children. Last year, the promotion also applied to Ukrainian refugees, but this time the organizers decided not to include them in this special day.",
        "\"In the announcement of the event, it was stated: 'After last year's aggressive criticism in the comments, this time we have decided not to include Ukrainian military refugees and their children in this campaign. We apologize',\"",
        "The organizers have warned visitors about the increase in prices for both attractions and various fast food items at the fairgrounds. This is due to the rise in operating expenses, primarily related to electricity. Depending on the specific attraction, prices will increase by 10-60 crowns compared to last year.",
        "The Matějská pouť is the oldest spring fair with attractions in Europe, with a history dating back to 1595. It has been held at the \"Výstaviště\" since 1963. The holiday is dedicated to the Day of Saint Apostle Saint Matthew (Matěj), celebrated by the Catholic Church on February 24th.",
        "Work schedule:",
        "From February 25th to April 10th, 2023.",
        "Tuesday to Friday from 1:00 PM to 9:00 PM",
        "Saturday, Sunday, holidays - from 10:00 to 22:00",
        "Monday - closed",
        "Cost of admission ticket:",
        "On weekends and holidays - 30 kroner (children under 130 centimeters tall - free).",
        "on weekdays - free for everyone;",
        "Payment for rides on attractions is made separately.",
        "Address: Výstaviště Holešovice, Prague 7",
        "Website: https://www.matejskapout.cz/",
        "Subscribe to our TELEGRAM channel, there the news comes out faster.",
        "© 2014-2025 vinegret.cz"
    ]
}