{
    "url": "https://www.vinegret.cz/708924/v-chekhii-na-podrabotke-pogib-15-letnii-ukrainets-veroiatno-on-trudilsia-nelegalno",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The Czech police are investigating an accident at a workplace in the village of Velké Hydčice (Pilsen Region), in which a 15-year-old boy received a fatal injury. According to the Novinky portal, the victim was a citizen of Ukraine who was working in a so-called \"brigade\" (a legal form of temporary work for young people with certain restrictions).",
        "The publication writes that the young man arrived at the factory with a relative. The tragedy occurred last Wednesday, August 27, around 07:00.",
        "One of the machines tore off the young man's arm - he died on the spot from shock and blood loss. The arriving medics were unable to help the victim. Resuscitation efforts continued for over an hour. A medical helicopter also flew to the scene, but it returned to base empty.",
        "The police confirmed the fact of the incident, but refused to disclose details. The case is being investigated under the article \"infliction of harm to health.\"",
        "The State Labor Inspection also deals with the tragedy. It checks whether the company followed all legal procedures when hiring for the \"brigade,\" as well as whether the young man himself committed any violations, such as safety procedures or whether he was in a place where he should not have been.",
        "The President of the Association of Recruitment Agencies of the Czech Republic, Radovan Burkovich, suspects that the Ukrainian worker was not officially registered for part-time work, meaning he was working illegally. The company refused to comment on the situation.",
        "\"I have a suspicion that he was directed there by some Ukrainian illegal agency,\" he told the Novinky portal, adding that he verified the information with members of the association from the Pilsen region.",
        "\"If the agency was legal, no one would hide it,\" Burkovich added.",
        "According to him, a 15-year-old teenager had nothing to do at such a production site. If he was assigned to operate a machine, then there was a violation of the regulations regarding work that is prohibited for women and minors.",
        "\"Given the very young age and everything that happened, it really gives us the impression that we are talking about illegal employment. The agency hires Ukrainians through websites or social networks and supplies cheap labor to the enterprise, usually without paying insurance contributions and taxes,\" described Burkovich a common practice.",
        "According to him, Ukrainian refugees often face such exploitation in the Pilsen region. The issue is also raised by representatives of non-profit organizations assisting migrants. They have pointed out unscrupulous agencies that literally exploit foreigners - not providing them with health insurance, not paying overtime, vacation pay, sick leave, or simply keeping part of their salary for themselves.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}