{
    "url": "https://www.vinegret.cz/708314/vkhod-besplatnyi-v-prage-proidet-vystavka-cheshskikh-koronatsionnykh-regalii",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "An exhibition of Czech coronation regalia will take place in the Vladislav Hall of the Old Royal Palace of Prague Castle, as ordered by the President of the Czech Republic, Petr Pavel. Admission will be free.",
        "The exclusive promotion will last for twelve days - from September 18 to September 29, 2025.",
        "Working hours - daily from 09:00 to 17:00.",
        "Let's note that the Czech coronation insignia are kept in St. Vitus Cathedral and were recently displayed to the public once every five years on the occasion of the inauguration of the President of the Czech Republic, as well as on particularly significant occasions.",
        "In 2024, the current head of the republic, Petr Pavel, decided to change this practice and ordered that from now on regalia should be displayed annually on the occasion of Czech Statehood Day. This national holiday is celebrated on September 28 and is also a day of honoring Saint Wenceslas.",
        "The regalia includes the crown of Saint Wenceslas, the royal scepter and the royal orb, as well as the golden coronation cross and the ceremonial sword of Saint Wenceslas.",
        "This year, the exhibition is subtitled \"Treasure in the Darkness\" (České korunovační klenoty: Poklad v temnotě). As the title suggests, it will introduce visitors to the fate of the Czech royal regalia during the Second World War.",
        "Even before the start of the global conflict, the President of Czechoslovakia, Edvard Benes, for security reasons, ordered to transport the regalia to Slovakia and hide them in a safe at the branch of the National Bank of Czechoslovakia. However, shortly afterwards, a decision was made for their urgent return to Prague.",
        "At the end of the war, part of the treasures were secretly bricked up in the Romanesque dungeon of the Old Royal Palace in Prague Castle, where they remained until they were retrieved in October 1945.",
        "The exhibition will tell the dramatic story of regalia through materials from the archives and collections of the Office of the President of the Republic, the collections of the Prague Castle Administration, and the photo archive of the ČTK agency.",
        "In addition to written sources, historical photographs and objects of material culture, including a box used for transporting regalia, will be presented.",
        "👉 Organizational details can be found on the Prague Castle website.",
        "❗️❗️Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}