{
    "url": "https://www.vinegret.cz/707660/v-oktiabre-es-zapustit-novuiu-sistemu-pogrankontrolia-chto-izmenitsia",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The European Commission has approved the launch date of the new entry-exit control system for third-country nationals crossing the external borders of the Schengen Zone for short stays (up to 90 days within a 180-day period). It will start operating on October 12, 2025, and will replace traditional passport stamps.",
        "The new Entry/Exit System (EES) is designed to strengthen control over illegal migration, prevent border crossings with fake documents, and help identify individuals who have exceeded the allowed stay in the EU.",
        "The system will also allow registering cases of entry refusal. If a traveler is denied entry to one of the Schengen Zone countries, this information will be recorded in the system, which may affect the possibility of visiting other member states.",
        "All incoming foreigners from third countries (not part of the European Union) will be required to provide biometric data (fingerprints and facial photograph) during passport control when crossing the Schengen Zone border for the first time. During subsequent visits within three years, border guards will only conduct facial scanning/photography. If a person refuses to provide biometric data, they will be denied entry.",
        "The electronic system EES will be used by all EU countries except Ireland and Cyprus. Additionally, Norway, Iceland, Switzerland, and Liechtenstein, which are not EU members but are part of the Schengen Area, will also use this system.",
        "The implementation of the EES will be gradual. Countries have been given six months for a full transition - until April 10, 2026. During the first three months, they are required to launch the system at half of their border checkpoints.",
        "Travelers will be informed about the new product through announcements at airports, visa centers, and border crossings.",
        "What personal data will be collected?",
        "Let's note that the EES system is the first part of the modernization of visa and border control mechanisms in the EU.",
        "The second element will be the implementation of the electronic system of prior registration ETIAS for citizens of countries with which the European Union has a visa-free regime. Registration will be mandatory and paid (costing 20 euros). The implementation of ETIAS is expected by the end of 2026.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}