{
    "url": "https://www.vinegret.cz/709380/istoriia-s-poriadochnym-prodavtsom-v-chekhii-poluchila-kurezno-trogatelnoe-prodolzhenie",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "A week ago, an elderly resident of the Czech city of Pardubice withdrew her savings from the bank and on her way home stopped by a small grocery store, where she then forgot an envelope on the counter containing 100,000 crowns, her ID, and a bank statement.",
        "The disappearance was discovered by an honest seller, who is also the owner of the store. He immediately called the police and refused the legally entitled reward of 10% of the found amount, which in this case is 10,000 kroner. The entrepreneur agreed only to have the patrol officers reveal his name to the happy pensioner.",
        "Now the story has received a continuation. The deeply touched woman returned to the store, without saying a word, discreetly placed another envelope on the counter and left. It had the name of the salesperson and words of gratitude written on it, and inside were 40,000 crowns.",
        "However, this time the man decided to refuse the reward. Since the pensioner had already left, he had to call the police again.",
        "\"The man once again refused to accept the reward and asked the patrol officers to return the money to the owner. And this time we fulfilled his noble request and returned the envelope with the money to the elderly woman. We hope that a third exchange of envelopes in Pardubice will not be necessary,\" said Jiří Sejkora, a representative of the municipal police.",
        "According to him, this is a completely bizarre case that he encountered for the first time in his many years of work.",
        "\"I personally approached the man to ask him to speak out about this unusual situation. However, he refused to comment and asked not to disclose his name publicly,\" Seikora added.",
        "❗️❗️ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}