{
    "url": "https://www.vinegret.cz/708930/praga-podarit-vsem-pervoklassnikam-bilet-v-planetarii-i-nabor-kantstovarov",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The Prague City Hall will continue its annual tradition and will give all first graders in schools under the city's jurisdiction a set of stationery, souvenirs, and useful items, as well as tickets to the planetarium and botanical garden. This was announced by the municipality in a press release.",
        "Each set includes pens, notebooks, a cotton drawstring bag for changing shoes, a double-sided erasable A4 board, pastel pencils in six colors, graphite pencils, a ruler, an eraser, and a glue pencil.",
        "School supplies are supplemented with items donated by municipal organizations and partners of Prague. These include a reflective tape and keychain (gift from the police), a cardboard model of a bus (souvenir from transport workers), a coloring book of ambulances (souvenir from medics), a notebook with animals (souvenir from the zoo), and other items.",
        "Thus, the authorities decided to please the children and at the same time help the parents a little, for whom the first of September is always associated with significant financial expenses.",
        "The city hall, together with municipal companies, has prepared 17,000 sets, which will be distributed to 223 schools by municipal police officers. They will be handed out to all first graders without exception on the first day of the school year, which in 2025 fell on the traditional September 1st.",
        "The total cost of the gifts amounted to 1.972 million crowns excluding VAT.",
        "\"The first day of school is a big step for children and parents, and we want them to have only good memories of it,\" said the mayor of the Czech capital, Bohuslav Svoboda.",
        "Let's remind that the Prague Planetarium reopened in June after a large-scale reconstruction, which made it the most modern in Europe.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}