{
    "url": "https://www.vinegret.cz/708209/v-chekhii-proidet-noch-uchenykh-2025",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Dozens of Czech universities and research centers will take part in the annual pan-European event \"Researchers' Night\" (Noc vědců 2025). It will take place on Friday, September 26th.",
        "The leading universities, observatories, planetariums, research institutes, and technical companies will offer entertaining and educational lectures, workshops, experiments, demonstrations of modern robots, musical performances, and access to places usually closed to visitors for free.",
        "The main goal of the campaign is to popularize science and technology among the general public, especially children and teenagers. The organizers hope to spark an interest in natural and technical sciences in young people, so that it is not limited to just watching educational TV programs, but motivates them to enroll in universities and become scientists.",
        "The event will take place for the twentieth time. The main theme of this year will be \"Wealth\".",
        "👉 The event schedule for each city is published at this link (the list is continuously being updated).",
        "\"Society is truly rich only when it utilizes the wealth of ideas. A society that intelligently manages its cultural and natural heritage and applies technology for its development. Join us in the search for the hidden treasures of science in all its diversity!\" - as stated in the event announcement.",
        "\"The Night of Scientists is an event that brings to life hundreds of scientific buildings in one evening, where an ordinary person usually does not enter. Visitors move between laboratories, lecture halls, exploding experiments, and immerse themselves in the depths of current topics. Children, adults, the elderly - everyone who is passionate about science is welcome. Meet our scientists, and they will teach you to love science.\"",
        "Starting from 2026, the event \"Night of Scientists\" will change its name to \"Night of Science\". The planned renaming reflects both the public demand for a gender-neutral name and the confidence that the name change will not affect the essence of the event and its long-term mission of popularizing science and research in all their forms,\" organizers noted.",
        "Such a promotion was held in previous years.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}