{
    "url": "https://www.vinegret.cz/4864/kak-vybrat-kacestvennyj-burchak",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In the Czech Republic, the season of burčák has started - a delicious, light, and healthy drink that is essentially fermenting grape must. Typically, the first sales begin in mid-August and last until mid-November. We invite you to familiarize yourself with winemakers' tips on how to choose genuine and high-quality burčák.",
        "The first and most important rule is to buy only the drink that you like the taste of. That's why you should always try a sample before making a purchase. Sellers will never refuse to pour a little for a taste, and tasting it immediately gives you an idea of the quality.",
        "\"Burchak and the Law\"",
        "According to the Czech law on winemaking (§15 of the law No. 321/2004 Sb.), \"burčák\" is a low-alcohol beverage made exclusively from fresh berries of cultivated grapes harvested in the territory of the Czech Republic. It is allowed to sell burčák only four months a year - from August 1st to November 30th (grape harvest season). Therefore, do not trust sellers who offer homemade wine made from apples or pears in July or December and proudly call it burčák.",
        "Appearance",
        "The burchak from white grapes should be opaque, with a color ranging from milky-yellow to light ochre. Cloudiness and the presence of small bubbles of carbon dioxide gas indicate that the drink is still fermenting - a sign of quality. If the burchak is not cloudy enough or even transparent, it is likely diluted with water.",
        "The brown color of the burlap indicates that it is made not from grapes, but from apples or other fruits. It is also a sure sign of a stale, over-fermented product with little benefit - the alcohol content is increased, the yeast has died, and the original fresh taste is lost.",
        "On the walls and bottom of a glass with a quality wine, you can see a small sediment (these are particles of yeast and remnants of grape pulp). Otherwise, it should not contain any foreign impurities.",
        "Burchak is a \"live\" drink, with yeast constantly at work in it. This is clearly visible when poured into a glass - bubbles of carbon dioxide are released with a characteristic hiss, forming foam.",
        "It is worth noting that there is also a red \"burčak\" which is produced from blue grape varieties. However, it is quite difficult to find it for sale due to its short shelf life. Unlike white \"burčak\", red \"burčak\" ferments on the grape juice, which is difficult to fit into a standard plastic bottle.",
        "Therefore, winemakers sell red young wine in containers only on the day of bottling, for example at wine festivals like \"Vinobrani\". The highest quality wine can be bought right at the vineyard - when the winemaker pours it for you from the barrel.",
        "Smell",
        "The burčak should smell exclusively of the grapes from which it is actually made. There should be no signs of decay or rotting smells - their presence indicates mistakes made by the winemaker during the production process.",
        "Alcohol content",
        "Burchak is a low-alcohol beverage, in strength comparable to beer. According to the established opinion among winemakers, the ideal alcohol content in it is from 4 to 6% by volume. But the range from 1 to 7% by volume is considered the norm. If the burchak is good, you will not feel any taste or smell of alcohol.",
        "Taste",
        "Burchak has a soft sweet taste of grape juice, with a slight acidity present. The aftertaste is harmonious, neither sweetness nor bitterness should dominate. Burchak is very easy to drink, the alcohol is barely noticeable, which is quite dangerous. If you get carried away, your legs will start to stumble as much as your tongue.",
        "How to store and drink burchak",
        "The kvass should be stored in the refrigerator, it is best to drink it within three days, and even better - a few hours after purchase. With each subsequent day, the drink will noticeably lose its taste and benefits.",
        "What are the benefits of a burlap sack?",
        "Where can I buy firewood?",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}