{
    "url": "https://www.vinegret.cz/709326/v-prage-sostoitsia-neobychnyi-kontsert-muzyka-v-temnote-2025",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "When the external light goes out, the internal one lights up. On Sunday, September 14, in Prague, the most unconventional event of the year will take place - the concert \"Music in the Dark\". Blind singer and pianist Jan Jares with the accompaniment of an ensemble will perform compositions of world music stars in complete darkness in the audience hall.",
        "Songs by Frank Sinatra, Louis Armstrong, Elvis Presley, Leonard Cohen, Paul McCartney, and other legends of jazz, swing, and pop music will be played.",
        "👉 Tickets can be purchased through this link.",
        "📍 The concert will take place at the Divadlo IMAGE theater in the very center of the city (Národní 25, Prague 1).",
        "🕖 Start at 7:00 PM.",
        "Unique experience",
        "The concert \"Music in the Dark\" is a unique experience where there is only live music and your imagination. It cannot be seen, but it can be felt.",
        "Despite the presence of other spectators in the hall, you will feel as if you are one-on-one with the music and the musicians.",
        "You will not just hear, but also be able to \"see\" and \"touch\" the music.",
        "Masterful performance",
        "The enchanting magic of the voice of the soloist Yan Yaresh will whirl you in a whirlwind of musical fantasies, new meanings, filling the words and melodies of familiar songs from childhood.",
        "The voice of Yan Yaresh will become a guide and a ray of light for you in the score of the concert, despite the fact that the world of the singer and pianist himself is forever immersed in darkness.",
        "The virtuoso musicians of the EUTERPE ensemble will play in complete darkness just for you, conveying great music from heart to heart. Performing in the dark requires the ensemble to have special professionalism, cohesion, and sensitivity, making their work unique.",
        "Give yourself the gift of time! Spend it in the company of wonderful musicians and music that enriches the soul.",
        "The text provided by the organizer",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}