{
    "url": "https://www.vinegret.cz/708916/v-chekhii-obnaruzhili-rukopis-romana-o-shveike-ona-90-let-prolezhala-v-arkhive-nezamechennoi",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In the archives of the Literary Archive of the Monument of National Literature of the Czech Republic (PNP), scientists have discovered the majority of the manuscript of the famous satirical novel by Jaroslav Hašek, \"The Adventures of the Good Soldier Švejk during the World War.\" This was reported by the director of the agency, Michal Steglík, on Thursday, August 28th.",
        "The texts that Hasek wrote or dictated up until his death in 1923 were found during the processing of his publisher Karel Sýnek's estate. The discovered manuscript will be restored, digitized, and then made available to the research community.",
        "The manuscript remained unnoticed for almost 90 years. It includes a fragment of Volume II, the complete Volume III, and partially Volume IV. Some of the texts were written personally by Hašek, while others were dictated to his assistant, the scribe Klement Štěpánek.",
        "Dictated pages predominate from the middle of Volume III.",
        "\"At first glance, it is unclear whether there are any unpublished fragments in the manuscript. This is something we will explore further during the restoration, digitization, and access provision process. However, it will undoubtedly be extremely interesting to compare the manuscript with what was subsequently published, especially regarding the third and unfinished fourth volumes,\" said Steglik.",
        "Let's note that the novel \"The Adventures of the Good Soldier Švejk During the World War\" is one of the most translated and read works of Czech literature. This satirical and anti-war novel in four volumes posthumously brought Jaroslav Hašek worldwide success, despite the fact that he did not manage to complete his work.",
        "The first volume of the novel titled \"In the Rear\" was published in 1921. Like the entire tetralogy, it satirizes the moods prevailing in the decaying Austro-Hungarian Empire and the chaos in the atmosphere of the impending war.",
        "The image of the main character, the simple soldier Švejk, is uniquely complemented by the illustrations of the artist Josef Lada - a close friend of Hašek.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}