{
    "url": "https://www.vinegret.cz/708779/praga-1-ustanovila-pervye-znaki-zapreshchaiushchie-vezd-elektrosamokatam",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The urban district Prague-1 got tired of waiting for a centralized solution from the city hall and took matters into its own hands by being the first in the entire capital to install road signs prohibiting the entry of electric scooters. They announced this on their official website.",
        "The sign was approved by the transport department of Prague-1 and coordinated with the transport department of the municipality. Within the timeframe established by law, no one contested it.",
        "The first signs were installed at the beginning and end of Nerudova Street near Malostranské náměstí, as well as on Úvoz Street. According to municipal authorities, this is where collisions between careless scooter riders and pedestrians most often occurred.",
        "The measure was taken in response to numerous complaints from local residents about violations of the rules by users of the electric scooter rental service. However, anyone can contact Prague-1 to request an exception from the ban. Each application will be considered on an individual basis. The exception also applies to cases of food delivery, goods, and other supplies (zásobování).",
        "\"While politicians in the city hall argue, Prague-1 takes action. The safety of people on the sidewalk is more important to us than the business of large companies and politicking in the city council. It had already become impossible to continue watching the chaos, clashes, and injuries in Lesser Town. That's why we took measures. If there is no centralized solution for the entire capital by November 1, 2025, we will expand the ban to other areas,\" said Voitech Rivola, the transportation advisor of the first urban district.",
        "Let's remind that in June, the city council of Prague unexpectedly and for a formal reason rejected the proposal for a city-wide ban on the rental of electric scooters.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}