{
    "url": "https://www.vinegret.cz/696641/v-prage-uluchshilas-dostupnost-kvartir-teper-rabotat-bez-edy-i-vody-nuzhno-vsego-14-7-goda",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "To save up for a new 70 square meter apartment, an average resident of Prague (earning the city's average salary) will need 14.7 years. And this is assuming that they will be saving all their earnings in Czech crowns. This conclusion is based on a recent study called the \"Housing Affordability Index\" (Index dostupnosti bydlení), conducted by the major Prague-based developer Central Group at the end of the third quarter of 2024.",
        "For the calculations, the authors took the market value of a 70-meter new building (11.25 million crowns) and compared it with the average \"gross salary\" in Prague (before tax deductions), which they estimated at 63,820 crowns per month. Thus, in order to purchase the desired apartment, a resident of Prague would have to deny themselves not only food and basic necessities for almost fifteen years, but also not pay taxes and social contributions.",
        "Researchers note that in year-over-year comparison, the indicator of availability of new apartments in Prague improved by 0.1 years, and compared to the first quarter - by 0.7 years.",
        "\"The situation has stopped deteriorating, but the numbers are still astronomical,\" commented the executive director of the company, Michaela Vanyova, noting that just ten years ago it took five annual salaries less to buy a new apartment.",
        "The availability of new buildings in Prague remains the worst among all neighboring capitals.",
        "For comparison, a resident of Berlin would need 8 annual salaries to buy a new apartment of the same size today.",
        "The main reason for the high cost of new buildings in Prague is the long-standing issue with the cumbersome and extremely lengthy process of obtaining construction permits, which prevents developers from meeting the high demand. According to experts' forecasts, the demand will only continue to grow as the population of Prague increases and mortgage rates decrease.",
        "The authors of the study note that in the Czech capital, for a long time now, they have been allowing the construction of an average of 5,000 apartments per year, while the city's demand is at least twice as high. Thus, the housing shortage in Prague is increasing annually and is already approaching the mark of 100,000 apartments.",
        "The departing 2024 will not be an exception. From January to September, 5270 new apartments were allowed to be built, so it is almost certain that the number of permitted apartments for the whole year will not come close to the required 10 thousand.",
        "\"By its inability to expedite the process of issuing construction permits, the state is shooting itself not in the foot, but directly in the spine. Only on apartments in Prague, the state treasury could receive over 175 billion crowns in VAT, as well as billions in contributions. The situation is causing huge damage to businesses and buyers, who have to unjustifiably overpay at least 15% of the cost,\" said Dusan Kunovsky, the head of Central Group.",
        "👉 Subscribe to our TELEGRAM channel, where news comes out faster.",
        "© 2014-2025 vinegret.cz"
    ]
}