{
    "url": "https://www.vinegret.cz/706937/na-meste-byvshego-pivzavoda-v-karlovykh-varakh-postroiat-zhiloi-kompleks",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In Karlovy Vary, on the left bank of the Ohře River near the railway station, a new residential complex called Nové centrum Rybáře will appear in the coming years. It will be built on the site of the former and already demolished brewery Pivovar Rybáře.",
        "The project by the developer AF Company involves the construction of several multifunctional buildings with underground parking lots. The ground floors will house retail spaces for shops, a pharmacy, cafes, dry cleaning, and other service businesses, while the upper floors will be residential.",
        "The company plans to build a total of 191 apartments and 6 townhouses. The project also includes landscaping of the area.",
        "It will feature a small square and a public park with playgrounds, benches, sports facilities, and recreational infrastructure.",
        "The construction of the complex will be divided into several stages. The first one is scheduled to start in the fall of 2025.",
        "Three buildings, ranging from 4 to 6 stories high, will be constructed on the site of the main brewery building. All of them will have underground parking and green roofs.",
        "If there are no bureaucratic delays, the first residents will move into their new apartments by the end of 2027.",
        "The new residential complex will have an exit to Dolní Kamenná Street. The construction of two-story townhouses near Kosmonautů Street is planned as part of the first stage.",
        "\"The new Rybáře center is designed to create and contribute to the improvement of life in this city district, as well as enhance the quality of the urban environment. It harmoniously blends in with the surrounding architecture and complements it with missing public spaces,\" the project description says.",
        "Let's note that the brewery Pivovar Rybáře was founded in 1879. After the Velvet Revolution, it produced Primus beer, as well as brands from the portfolio of its owner - the brewing giant Plzeňský Prazdroj. In 1999, for economic reasons, it decided to close the plant in Karlovy Vary, and in 2004, it sold it to the company Upmann Style, which planned to create warehouse and commercial premises on the site.",
        "However, in reality, the property stood idle, deteriorated, and gradually fell into disrepair, becoming a shelter for the homeless. As a result, in 2018, the former brewery changed ownership once again - the new owner became the company AF Company.",
        "She announced plans to reclaim the territory for the construction of affordable and quality housing, after which she began the lengthy process of obtaining all the necessary documents. Just obtaining permission to change the city plan and demolish the plant took 6 years.",
        "© 2014-2025 vinegret.cz"
    ]
}