{
    "url": "https://www.vinegret.cz/709498/politsiia-pragi-pokazala-zapis-idiotskogo-postupka-iz-za-kotorogo-vstalo-metro",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The Prague police are searching for an unknown person who, on August 26 around 17:00, rode on the coupler of a metro train car and then fled. Because of him, the movement of trains between Kačerov and Háje on the \"C\" line was stopped for 40 minutes.",
        "The investigators seized a large number of video recordings from surveillance cameras, which show that the wanted person first climbed onto the coupler between the train cars at Kačerov station and rode to Roztyly station. There, he walked along the wall to the first car, grabbed onto the coupler again, and rode to the next station, Chodov.",
        "Before the departure of the train, an unknown young man approached the locomotive engineer. Investigators believe that he is acquainted with the wanted person and deliberately distracted the attention of the train driver.",
        "Similarly, the cameras captured a passenger who was waiting for the train to arrive at Chodov metro station and had already started recording what was happening on their smartphone.",
        "Everyone who recognizes the extreme sports enthusiast captured on the video is asked to call the number 158.",
        "The investigators are handling this case under the charge of \"hooliganism,\" which carries a punishment of imprisonment for up to two years.",
        "In its press release, the police refer to the wanted individual as a man, although it is clearly visible in the recording that the \"troublemaker\" and his friends are more likely teenagers. Moreover, such antics are usually common among schoolchildren.",
        "\"The suspension of metro services and the provision of alternative surface transportation posed a completely incomprehensible and unjustified risk to people's lives. Due to this, the Prague Transport Company also suffered financial losses,\" said law enforcement representative Eva Kropachova.",
        "Let's remind you that immediately after the incident, information appeared that the intruder ran into the tunnel at Chodov station after passing through the coupling. This was the reason for the long delay in the metro operation - the police carefully checked the tunnel but did not find anyone.",
        "They simultaneously watched the recording from the surveillance camera and confirmed that the perpetrator had climbed onto the platform and escaped from the station via the stairs. Only after that was train service restored.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}