{
    "url": "https://www.vinegret.cz/708787/zhiteli-chekhii-spustia-shest-let-vnov-uvidiat-krovavuiu-lunu",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Residents of the Czech Republic will be able to observe a total lunar eclipse for the first time in the last six years. It will begin on Sunday, September 7, at 19:30 Prague time. The darkened full moon will also allow for easy observation of the planets Saturn and Neptune. This was reported in a press release by the Czech Astronomical Society.",
        "The last total lunar eclipse was observed in the Czech Republic in January 2019, and the next one will have to be waited for until December 2028.",
        "An eclipse occurs when the Moon passes through the Earth's shadow.",
        "\"Astronomers have reported that even during a total eclipse, the Moon will not disappear from the sky because long-wavelength (red) rays of sunlight will continue to fall on its surface, refracted inside the Earth's shadow by our atmosphere.\"",
        "The duration of a total eclipse depends on how much of the Earth's shadow the Moon passes through. The closer it passes to the center of the Earth's shadow, the longer the eclipse lasts.",
        "🕢 On Sunday, September 7, the eclipse will begin at 19:30 Central European Time (same as Prague time), very low above the eastern horizon, and will last for 1 hour, 22 minutes, and 6 seconds.",
        "The eclipse will reach its maximum phase at 8:11 p.m.",
        "After that, you will be able to observe the Moon exiting the Earth's shadow - the partial eclipse will end at 21:56.",
        "\"Thus, this will be one of the longest total eclipses in this decade,\" the press release states.",
        "In Prague, the Moon will rise four minutes after the start of the total eclipse, making it quite difficult to spot in the twilight due to reduced brightness. To the east of the darkened lunar disk, two planets of the Solar System will be visible in the sky - Saturn will be visible to the naked eye, while Neptune will be visible through a small amateur telescope.",
        "Why is a total lunar eclipse called \"blood moon\"?",
        "During a total lunar eclipse, the Moon does not disappear from view but instead turns dark red. This phenomenon is explained by the fact that sunlight, passing through the Earth's atmosphere at a tangent, gets scattered. Since the atmosphere is most transparent to the red-orange part of the spectrum, those are the rays that reach the surface of the satellite, coloring it in a reddish hue.",
        "Therefore, in the folklore, this phenomenon was given the name \"bloody Moon\".",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}