{
    "url": "https://www.vinegret.cz/709339/mvd-chekhii-soobshchilo-skolkim-ukrainskim-bezhentsam-odobrilo-spetsialnyi-vnzh",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Monday, September 8, the Ministry of the Interior of the Czech Republic published statistics on the procedure for Ukrainian refugees transitioning from a temporary protection visa to a special type of long-term residence permit (zvláštní dlouhodobý pobyt, long-term residency permit).",
        "From the published data, it follows that:",
        "- About 80,000 Ukrainian refugees have shown interest in obtaining a special residence permit.",
        "- Of them, about 15,000 people met all the requirements. This is 20% of the total number who expressed interest.",
        "- Among the approved applicants, 81% are people of working age, while 18% are children.",
        "- The majority of Ukrainians, whose applications were fully approved, live in Prague (22.5%), Central Bohemia (15.5%), and Plzeň Region (14%). The fewest live in Hradec Králové Region (3%).",
        "Now successful applicants must go through the online registration procedure for the final stage of transitioning to a special residence permit - choose a date and time for a personal visit to the migration department of the Ministry of Internal Affairs to submit biometric data. Registration opened on the morning of September 8 and will continue until December 31, 2025, inclusive.",
        "\"The specified deadline attracted interest in obtaining a special residence permit from almost 47 thousand households (around 80 thousand people). Basic conditions related to the duration of stay in the territory, non-receipt of benefits or conditions related to medical insurance were not met by 35% of households. Another 45% did not meet the required annual household income level,\" the ministry wrote.",
        "Let's remind that the special long-term visa is granted for 5 years and provides the opportunity to obtain permanent residency and Czech citizenship in the future. However, in order to obtain it, the applicant must meet a number of conditions that many experts and employers have described as stringent.",
        "⚠️ Refusal to provide a special residence permit does not affect the status of temporary protection. It continues to be valid.",
        "Conditions can soften.",
        "It is important to note that the first wave of transition to a special residence permit is currently underway. Most likely, there will be a second wave in 2026. Moreover, with the new wave, the conditions for obtaining a special residence permit may be relaxed. If any of the applicants are denied now, they will be able to try again.",
        "\"On September 8, a representative of the Ministry, Adam Rözler, stated that after evaluating the first wave, the government will decide whether to announce the next round of expression of interest and under what conditions. The goal is to ensure a smooth transition to long-term residency for those who want to live and work in the Czech Republic long-term, while also maintaining support for those who still need it.\"",
        "Earlier, the Ministry of Internal Affairs acknowledged that the relatively high requirements of the first wave were deliberately chosen, in part to avoid overloading the migration system. The department was concerned that with a large number of applicants, officials simply wouldn't have enough hands to process all the applications. This could disrupt the work of the migration department, which serves not only refugees but also other foreigners under the standard residence law.",
        "❗️❗️ Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}