{
    "url": "https://www.vinegret.cz/649459/V-kinoteatrakh-Chekhii-proidet-blagotvoritelnyi-pokaz-filma-Svideteli-Putina",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Tuesday, March 8th, a charity screening of the film \"Witnesses of Putin\" (Svědkové Putinovi) by Russian director Vitaly Mansky will take place in over thirty cinemas in various cities in the Czech Republic. The film received the main prize at the Karlovy Vary Film Festival in 2018 in the documentary section.",
        "All sessions will start at the same time - at 8:00 PM. All the money raised from ticket sales will be donated to help the residents of Ukraine affected by the war.",
        "In Prague, the film will be shown in five cinemas. The full list of them is published at the end of the article. At Kino Světozor, after the screening, viewers will be able to stay and participate in a discussion about the situation in Ukraine with experts. Among the invited guests is the well-known Czech journalist Ondra Soukup. The ticket price is 159 Czech crowns. You can buy it through this link.",
        "At the core of the film are the shots made by director Vitaly Mansky about the first three months of Vladimir Putin's presidency - from the moment Boris Yeltsin resigned on December 31, 1999, until the elections of 2000.",
        "Shortly after his election, Vladimir Putin reintroduces the red flag to the army and the Soviet anthem with updated lyrics, explaining: it is necessary to give citizens a sense that they have not lost everything with the collapse of the USSR, all this symbolism should be associated not with camps, but with the victory in the Great Patriotic War.",
        "In the movie, the director seems to be trying to answer the question of whether it was possible to predict back then what kind of president Putin would become and how long he would stay in power.",
        "\"Putin's Witnesses\" will be shown on March 8 in the following Czech cinemas. Look for tickets on their official websites:",
        "Kino Světozor in Prague\nBio Oko in Prague\nPřítomnost in Prague\nCinestar Anděl in Prague\nBio Central in Hradec Králové\nKino Zahrada in Prague\nSenator's Office of Marek Hilšer in Prague\nCity Library in Dolní Bousov\nRic Celtic Oppidum Závist in Dolní Břežany\nSvět in Hodonín\nCity Cultural Center Horní Slavkov\nBiograf Český Ráj in Jičín\nKino City in Kuřim\nCity Cinema in Lomnice nad Popelkou\nVesmír in Náchod\nKino Napajedla\nEtáž in Ostrava\nFilm Club Plzeň\nPelly's Houses (Kolárovo Theatre) in Police nad Metují\nMetro 70 in Prostějov\nHvězda in Přerov\nPanorama in Rosice\nJitřenka in Semily\nObservatory in Slaný\nVesmír in Svitavy\nCafé and Books Jednota in Tábor\nKino Morava in Veselí nad Moravou\nPanorama in Vítkov\nKD Střelnice Vrchlabí\nKino Volyně\nGolden Apple in Zlín\nGap Gallery in Zlín\nFidiko in Žamberk",
        "Additional information is available at this link.",
        "Subscribe to our Telegram channel, where news comes out faster.",
        "© 2014-2025 vinegret.cz"
    ]
}