{
    "url": "https://www.vinegret.cz/708497/torgovaia-inspektsiia-chekhii-obnovila-spisok-riskovannykh-internet-magazinov/",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In the second quarter of 2025, the Czech Trade Inspection (ČOI) continued to monitor the operation of online stores, focusing on those suspected of not fulfilling their legal obligations.",
        "During the period from April 1st to June 30th, inspectors conducted 125 inspections and identified violations in 106 of them (which is 85% of cases). The department explained that this number does not reflect the situation in the market as a whole, as mainly those stores were inspected which consumers complained about.",
        "Some sellers were found to have multiple violations by inspectors. The department registered 173 cases of non-compliance with consumer protection laws and 151 violations of the civil code.",
        "The most common offenses of online stores were:",
        "- failure to properly inform the consumer about the conditions, terms, and procedures for exercising the right to withdraw from the commercial contract (92 cases);",
        "- failure to fulfill the obligation to properly inform the client about the scope, conditions, and procedure for filing a complaint (63 violations);",
        "- the use of unfair trading practices that can disrupt consumer economic behavior and lead them to make a decision they would not have otherwise made (52 incidents). This primarily referred to providing false information about the product, service, delivery times, and consumer rights (24 cases).",
        "In the second quarter of 2025, 167 fines imposed by the inspection on dishonest online stores came into effect. The total amount of sanctions imposed was 3.45 million crowns.",
        "📋 ČOI regularly updates its list of risky online stores where making purchases may not be safe: www.rizikove.cz",
        "The department includes sellers who do not comply with certain legal norms and are difficult to hold accountable for this. The list is purely advisory and is intended to increase consumer awareness and vigilance.",
        "❗️❗️ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}