{
    "url": "https://www.vinegret.cz/708957/mvd-chekhii-soobshchilo-podrobnosti-finalnogo-etapa-perekhoda-na-spetsialnyi-vnzh",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Friday, August 29, the Ministry of the Interior of the Czech Republic published details for Ukrainian refugees on the final stage of transitioning from a temporary protection visa to a special long-term residence permit (zvláštní dlouhodobý pobyt, special long-term residence permit).",
        "On September 8th, Ukrainians will be able to find out the status of their applications submitted during the first stage in April. This information will be available in their personal account on the Information Portal for Foreigners (more details).",
        "In case of a positive decision, the applicant will need to go through the online registration procedure to visit the migration department of the Ministry of Internal Affairs (choose a date and time for the visit), and then visit there twice. The first time - to provide fingerprints, take a photo, sign on an electronic tablet, and submit documents (if required), and the second time - to collect the ready biometric residence permit card.",
        "Registration",
        "Registration will be open from September 8th to December 31st, 2025. This means that everyone will have a chance to complete it.",
        "You will find the \"Registration\" button after logging into your personal account in the \"Zvláštní dlouhodobý pobyt\" section (Special long-term residence permit). The button will be active only if you have successfully shown interest and meet all the requirements.",
        "The first step of registration is entering your personal data into the form. In the case of registering a joint household, the form is filled out by the main applicant on behalf of all individuals.",
        "The second step is to book a date for your visit at the migration department of the Ministry of Internal Affairs. The portal will automatically assign the appropriate department based on the address you provided in the registration form.",
        "The selected date can be changed or, if it is missed, a new one can be set, but only once.",
        "All individuals listed in the application must be present at the Ministry of Internal Affairs (if the application was submitted within a joint household). Therefore, when choosing a date, make sure it suits all jointly registered individuals, and also ensure that you have all necessary documents on hand on the date of the visit (see below).",
        "I will have to go to the migration department of the Ministry of Internal Affairs twice.",
        "According to the selected date following online registration, you must arrive at the designated branch of the Ministry of Internal Affairs, provide the necessary documents, and undergo the procedure of biometric data collection. After that, you will be given a new date to come and collect your ready biometric card.",
        "First visit",
        "All members of the household, including children, must be present due to the necessity of collecting biometric data.",
        "In the department, the following will be required:",
        "✅ Present a valid international passport.",
        "✅ Confirm the connection with all jointly registered household members (including adults), for example, using the original birth certificate or marriage certificate. Information on how to confirm the connection with individuals under the age of 18 can be found at the following link: [link].",
        "✅ Pay the administrative fee for processing each residence permit card. It amounts to 2500 crowns (for individuals under 15 years old - 1000 crowns). The fee can only be paid by bank card directly at the Ministry of Internal Affairs office.",
        "✅ If the condition of mandatory school attendance by the child was highlighted in yellow during registration, you need to bring a document confirming compliance with this condition (for example, a certificate of the child's education or their latest report card).",
        "If it is impossible to fulfill this condition, it is necessary to provide a justification for the reason.",
        "Official certification of the translation of these documents into Czech is not required.",
        "What situations require the submission of additional documents?",
        "How to do it:",
        "Important",
        "© 2014-2025 vinegret.cz"
    ]
}