{
    "url": "https://www.vinegret.cz/703955/v-chekhii-khotiat-vernut-dedovskuiu-kontseptsiiu-stroitelstva-eto-mozhet-udeshevit-kvartiry",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In the Czech Republic, in a few years, they may start building apartments based on a concept that is currently used in Austria, and in the past has proven its effectiveness in the Austro-Hungarian Empire and pre-war Czechoslovakia.",
        "The Ministry of Regional Development of the Chechen Republic is preparing a draft law that will allow municipalities and private individuals to establish so-called limited profit companies. These companies will primarily allocate their profits towards the construction of more affordable housing.",
        "\"We expect that this will allow us to build housing at affordable prices,\" Minister of Regional Development Petr Kulganek told Novinky portal.",
        "The proposed law should create a space in the market for companies so that they have funds left to finance new projects, but at the same time, they would not be able to achieve maximum profitability. Thanks to this, such developers will be able to offer housing at lower prices than competitors.",
        "\"The apartments built according to this concept will be primarily intended for rent,\" Kulganek added.",
        "The authorities consider the bill as one of the ways to solve the current issue of excessively expensive real estate. Prices for new buildings and secondary housing have risen so much that even people with average incomes in large cities such as Prague or Brno cannot afford to buy them. More and more families are forced to rent apartments, but due to a lack of supply in the rental market, rental rates are also increasing.",
        "A special group within the ministry is currently finalizing the specific form of the future law. Therefore, it is unlikely that the government will be able to adopt it in the current electoral cycle. It is important to bring the document to a stage where the next government can continue and complete it.",
        "The publication notes that the bill has good chances of not being forgotten after a change of power. The ANO party, the main favorite of the upcoming elections, has a positive attitude towards it.",
        "\"We will definitely consider this idea if we come to power. It makes sense,\" said the vice-chairman of the party Karel Gavlicek. He reminded that the previous government under the leadership of ANO was also preparing a similar bill, but in the Chamber of Deputies, it only reached the second reading.",
        "Quality and development",
        "The most famous city where such developers work today is Vienna. Non-profit developers build entire new neighborhoods there or participate in the reconstruction of existing residential buildings.",
        "Economist of the company PAQ Research Jakub Komarek supports the idea of creating such companies in the Czech Republic.",
        "\"Housing companies with limited profit are exactly the tool that can bring significant changes to Czech housing policy. In particular, their development is recommended by NERV (National Economic Council). Such firms plan for the long term and build with quality,\" he said.",
        "Komarek reminded that similar companies existed back in the times of the Austro-Hungarian Empire and in pre-war Czechoslovakia. They disappeared completely after the communists came to power in 1948.",
        "The initiative to create developers with limited profit is part of the ministry's efforts to increase the municipal housing fund. Last year, its construction began to be actively supported through subsidies and credit programs. The first apartments thanks to these measures are expected to start being built already this year.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}