{
    "url": "https://www.vinegret.cz/709260/v-chekhii-dikie-kabany-podlozhili-sviniu-futbolnomu-klubu",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In Brno, wild boars behaved like pigs - they dug up the football field at the stadium of the SK Jundrov club, which competes in the city championship. As a result, instead of their Friday training session, the players had to go on an unplanned cleanup day on Saturday.",
        "Together with their families, they did their best to eliminate the damage caused. In several places, wild boars dug up the lawn so much that it became unsuitable for hosting official matches.",
        "The restoration will take 3-4 weeks, and the total damage due to re-sodding the lawn and repairing the damaged fence will amount to around 400 thousand crowns.",
        "The incident occurred on Friday morning, September 5th. Several residents of the urban part of Brno-Jundrov saw a herd of wild boars at the stadium between 06:00 and 07:00.",
        "\"I left on Thursday at 9:00 PM, and everything was fine. On Friday at six in the morning, a woman who went out to walk her dogs was the first to see wild boars. Then a colleague who arrived on the scene took photos and shot a video, made a recording exactly at 06:48. There are wild boars with piglets in the footage,\" said Radim Krzivanek, the chairman of the SK Jundrov club.",
        "According to him, in the 25 years of the local football field's existence, this has never happened before.",
        "Now Krzivanek intends to negotiate with the city authorities so that during his next visit he can call hunters, and they will have the right to shoot wild boars. However, the club chairman realizes that obtaining such permission will be difficult, if possible at all.",
        "However, even hunters are not a panacea. According to witnesses, this time the wild boars left on their own and quite quickly.",
        "Today, during the day, families of players with children tried to trample the dug-up pieces of turf back into the ground after moistening them. About 60 dedicated volunteers gathered for this task.",
        "\"We will try to see if the grass takes root. The specialist I consulted with told me that there is a 90% chance it won't. This will be a big problem because then we will have to lay a new lawn, and that is very costly,\" Krzivanek concluded.",
        "On Saturday, the club was supposed to play a home match of the eighth division. Now the game will either be postponed to a new date or moved to an artificial field in the neighboring village.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}