{
    "url": "https://www.vinegret.cz/708012/v-prage-vor-vskryval-ukradennyi-seif-pered-zdaniem-politseiskogo-prezidiuma",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Definitely not one of Ocean's friends - this is how you can characterize the unlucky thief who embarked on the job without bothering to study the area and plan an escape route.",
        "On Friday morning, August 8th, he stole a safe from a shopping center in the urban part of Prague-7 and even managed to carry it out onto the street. However, things quickly went awry. After walking 200 meters, the criminal decided to stop to examine the contents of the metal box.",
        "The man chose a very unfortunate place to take a break - he sat right in front of the entrance doors of the Police Presidium of the Czech Republic on Strojnická Street, and even under surveillance cameras.",
        "The security guards saw this image on the monitor screen and immediately directed the patrol officers to the brazen thief. The thief was quickly apprehended.",
        "\"You couldn't make up a case like this on purpose. Officers from the security service, in cooperation with the municipal police patrol, have detained a man and are currently taking procedural actions in a criminal case, within which we will be interested in details about both the identity of the detainee and the crime itself,\" the law enforcement press service reported.",
        "Representative of the police presidium Ondrej Moravchik described the situation as extremely bizarre in a conversation with a journalist from the iDNES portal. He also added that the department is currently analyzing the incident and studying the recordings from the surveillance cameras.",
        "At the moment, investigators have not disclosed under which specific article they are investigating the incident. If we assume that there was a burglary with forced entry, the suspect could face up to two years in prison.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}