{
    "url": "https://www.vinegret.cz/645962/v-prage-proidet-besplatnaia-lektsiia-belaia-emigratsiia-belogvardeitsy-belolentochniki-belarusy",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Tonight (December 14) at the Prague cafe Langhans (Vodičkova 707/37) there will be a lecture \"White Emigration: White Guards, White Ribboners, Belarusians\". It starts at 7:00 PM. Admission is free, everyone is welcome.",
        "This year marks the 100th anniversary of the \"Russian Relief Campaign\" declared by the Czechoslovak government for refugees from the Russian Empire, and the 10th anniversary of the protest on Bolotnaya Square, the authorities' reaction to which sparked a new wave of emigration. In 2020, after the presidential elections, several hundred thousand people left Belarus for political reasons.",
        "Let's talk about the mission and results of the \"Russian Relief Action\" by President T.G. Masaryk, about the challenges faced by different waves of emigration, and how everything works in the 21st century.",
        "The discussion moderator is Olga Storozheva, a participant of the Czech International Memorial, a researcher, and an educational program coordinator.",
        "Speakers:",
        "- Anna Khlebina, librarian at the Slavic Library, historian of the project \"Czechoslovaks in the Gulag\".",
        "- Oleg Alexeev, former deputy coordinator of Navalny's headquarters in Kaliningrad, a scholarship recipient of the \"Nemtsov Foundation\".",
        "- Kristina Shyenok, representative of the Belarusian national minority in the City Council of Prague, a court interpreter.",
        "- Yakub Muchka, founder of the media project Atlas of today's world and co-founder of the Eastern European Club (Východoevropský klub).",
        "Friends, we invite you to the first meeting of the new project \"WILL MAKE SENSE\", the goal of which is to make the Russian-speaking life in Prague more diverse.",
        "Come over, there will be cookies, wine, and books!",
        "Entry to the event is allowed upon presentation of a vaccination certificate or proof of recent illness.",
        "Additional information can be found at this link.",
        "The text provided by the event organizer",
        "© 2014-2025 vinegret.cz"
    ]
}