{
    "url": "https://www.vinegret.cz/709151/v-prage-postroiat-samoe-vysokoe-zdanie-v-strane",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Monday, September 1st, the Prague City Council approved a change in the territorial plan necessary for the construction of a multifunctional skyscraper called Top Tower, which is planned to be built by the development company Trigema near the Nové Butovice metro station.",
        "At the same time, the advisors approved a framework agreement under which the investor will contribute to the budget of the municipal part of Prague-13 and the city council in the amount of approximately 75.7 million crowns. This amount will be partially paid in cash and partially in the form of public space improvement.",
        "The Top Tower, standing at 135 meters tall, is set to become the tallest skyscraper in the whole of the Czech Republic. Inside, there will be rental apartments, shops, offices, as well as a cultural and entertainment center. There are no exact timelines for the project implementation yet.",
        "The building itself will have a height of 125 meters. An additional 10 meters will be added to it by a decorative structure of a rusty \"skeleton\" (frame) of a modern ship, which was jointly designed by architect Tomasz Ciszarz and artist David Cerny.",
        "The construction of the skyscraper was previously criticized by the opposition of Prague-13 and some local residents. On the contrary, the leadership of the city district welcomes the idea and signed a memorandum with the investor for the construction of the facility five years ago.",
        "In the approved framework agreement on Monday, it is stated that Trigema will pay the authorities a so-called contribution in the amount of 75.7 million crowns. Of these, 60.7 million crowns will go to the Prague City Hall, with 14.7 million in cash and the rest in the form of revitalizing a parking lot and an underground crossing under Bucharova Street, building two elevators to the pedestrian zone, and improving the public space in front of the Lípa clinic.",
        "The urban part of Prague-13 will receive 15 million crowns. In addition, the company will also arrange for a new pedestrian crossing, a passage under Seydlerova Street, and a driveway for supplies under Bucharova Street.",
        "Prague requires all developers to pay contributions due to the need to change the territorial plan and adjacent territories. The amount depends on the area of the buildings being constructed.",
        "Five years ago, Trigema released a video explaining how the rusty hull of a ship ended up on top of a skyscraper. It all has to do with global warming and a worldwide flood:",
        "It should be noted that currently the tallest building in the Czech Republic is the 111-meter tall skyscraper AZ Tower in Brno, which was opened in 2013. It houses shopping areas and offices, with residential apartments on the highest floors. In the summer of 2025, an observation deck was opened on its roof.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}