{
    "url": "https://www.vinegret.cz/708832/ukraintsam-v-chekhii-skoro-soobshchat-rezultaty-zaiavok-na-spetsialnyi-vnzh-kogda-i-kak-eto-budet",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Registration for the second stage of transitioning from a temporary protection visa to a special type of long-term residence permit for Ukrainian refugees in the Czech Republic (zvláštní dlouhodobý pobyt, special long-term residence permit) will start on September 8, 2025. This was announced by the Ministry of Internal Affairs of the Czech Republic.",
        "On this day, all those who expressed a desire in April to switch to a special long-term residence permit will be able to find out if their application has been approved. The information will be available after logging into their personal account on the Information Portal for Foreigners (https://ipc.gov.cz/).",
        "Each individual condition for obtaining a special residence permit will be evaluated separately and marked with one of the following colors:",
        "Green: condition met;",
        "Red: condition not met - registration is not possible;",
        "Yellow: the condition is partially met - it will be necessary to provide supporting documents during the visit to the migration department of the Ministry of Internal Affairs.",
        "Black: the condition was not relevant and therefore was not evaluated.",
        "If all conditions are met, you will need to proceed to the next step in your personal account, namely to start the registration for a special residence permit and then make an appointment at the migration department of the Ministry of Internal Affairs.",
        "If initially the desire was expressed jointly by several family members within the framework of a common household, then the registration and subsequent appointment booking is carried out only by the so-called founder of the common household (on behalf of all its members).",
        "Registration will take place from September 8th to December 31st, 2025.",
        "❗️ Changing the appointment time (rescheduling a upcoming meeting or scheduling a new one in case of absence) will only be possible once. Therefore, the applicant should initially choose a date and time when they can definitely come to the Ministry of Internal Affairs with all registered members and when they will definitely have all the necessary documents on hand.",
        "Until September 8, the department promises to publish a clear and step-by-step video instruction on the registration process. It is already being prepared.",
        "Let's remind you that at the first stage of transitioning to a special residence permit, refugees were required to express their desire to obtain this type of permit by filling out a special form in their personal account on the portal for foreigners by the end of April.",
        "Only those Ukrainians whose applications have been deemed to meet the requirements for obtaining a special residence permit will be allowed to proceed to the upcoming second stage. They will only need to choose a date and time to visit the migration department of the Ministry of Internal Affairs to provide their biometric data, and in some cases, submit supporting documents (highlighted in yellow on the diagram).",
        "In May, the Ministry of Internal Affairs reported that more than 82,000 people applied for a special residence permit. The number of approved applications is currently unknown.",
        "✅Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}