{
    "url": "https://www.vinegret.cz/670031/V-Prage-prodlili-unikalnuiu-vystavku-Mastera-Renessansa",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Due to high interest from the citizens, the organizers have extended the international art exhibition \"Masters of the Renaissance\" (Mistři renesance), which is taking place at the Mánes Gallery in the very center of Prague. It allows visitors to see over 50 reproductions of the greatest paintings in history in one place - \"David\" by Michelangelo, \"Lady with an Ermine\" by Leonardo da Vinci, \"Sistine Madonna\" by Raphael, and many others.",
        "The exhibition has been extended until August 27th.",
        "With its unique way of presenting exhibits, it stands out favorably from the traditional and somewhat dull museum experience. The organizers have made an effort to ensure that art is easily understandable for a wide audience and children, so that everyone can receive positive emotions from getting acquainted with the greatest artists of the past.",
        "Not the least role in this is played by the fact that the paintings presented at the exhibition are known worldwide - they have been shown, mentioned, or parodied countless times in movies and advertisements. For example, such works as Leonardo da Vinci's \"Vitruvian Man\" or Michelangelo's fresco \"The Creation of Adam\" have become part of mass culture or common heritage, being among the most famous visual expressions of European civilization.",
        "To see the originals of all the reproductions presented at the exhibition, you will have to visit dozens of cities around the world. Some of them are located in private collections and are not accessible to the general public.",
        "\"The Masters of the Renaissance\" gives visitors the opportunity to immerse themselves in the impressive artistic world of the great old Masters without haste and fuss, and embark on a journey to discover the true icons of the Renaissance era.",
        "Address: Galerie Mánes, Masarykovo nábřeží 250, Prague 1 (view on map)",
        "Working hours: daily from 09:00 to 19:00. The exhibition will last until August 27, 2023.",
        "Tickets can be purchased through this link or at the box office on site.",
        "Website: mistrirenesance.cz",
        "\"The audio guide in Czech and English will guide you through the exhibition, so make sure to bring headphones with your smartphone. At the 'Lady with an Ermine,' we will draw your attention to her unassuming headgear, and also explain the symbolism behind the animal in the woman's hands. At the 'Sistine Madonna,' we will not only focus on the famous angels at the bottom of the painting, but also uncover other, slightly more hidden images.\"",
        "The design of the exhibition with crystal chandeliers and decorative arches enhances the impression that we are truly in the distant past. You will contemplate the famous \"The Birth of Venus,\" and then see the monumental statue of David in life size.",
        "Sitting on a comfortable bench, you will be able to study the frescoes of the Sistine Chapel in the finest detail, as well as compare reproductions of the original \"Mona Lisa\" from the Louvre, and its copy from the Prado Museum in Madrid,\" the exhibition description says.",
        "Tickets can be purchased through this link or at the box office on site. The exhibition will only be open until May 30th, daily from 09:00 to 19:00, at Galerie Mánes, Masarykovo nábřeží 250, Prague 1.",
        "Subscribe to our TELEGRAM channel, where news comes out faster.",
        "© 2014-2025 vinegret.cz"
    ]
}