{
    "url": "https://www.vinegret.cz/709251/vkhod-besplatnyi-v-chekhii-proidet-aviashou-dni-nato-2025",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Saturday and Sunday, September 20 and 21, the annual \"NATO Days\" (Dny NATO 2025) will take place in the Czech city of Ostrava - the largest festival of military air and ground security forces in Europe, as well as the most visited family event in the Czech Republic. Admission for spectators will be free as usual.",
        "17 countries have confirmed their participation so far, including the USA, Canada, Italy, Germany, Turkey, the United Kingdom, Spain, France, Belgium, and Croatia.",
        "In addition to demonstration flights, spectators will also see a display of the capabilities of ground forces featuring tanks, armored personnel carriers, air defense systems, and other combat vehicles.",
        "A total of 80 performances are planned with the use of approximately 60 aircraft units.",
        "From the already confirmed machines, the following stand out:",
        "- fifth-generation fighter F-35A Lightning II:",
        "- military transport Airbus A400M ATLAS:",
        "- multi-purpose helicopter NHI NH90:",
        "- Eurofighter Typhoon fighter jet:",
        "- helicopter UH-60 BLACK HAWK:",
        "- Boeing KC-135 Stratotanker aerial refueling aircraft:",
        "游늸 The show will take place at the \"Mo코nov\" airfield (Leti코t캩 Leo코e Jan치캜ka Ostrava).",
        "游돆 Time of the event:",
        "September 20, Saturday - from 08:30 to 18:00.",
        "September 21, Sunday - from 08:30 to 17:00.",
        "游 Free entry.",
        "游녤 The full list of participating equipment (still being updated) and all additional information can be found on the event website.",
        "It should be noted that last year the show was canceled due to severe flooding in the Czech Republic, while in 2023 it was attended by 185,000 people in just two days.",
        "Photo credit: natodays.cz, 3.0 Unported (CC BY 3.0)",
        "仇勇仇勇뀹ubscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "춸 2014-2025 vinegret.cz"
    ]
}