{
    "url": "https://www.vinegret.cz/709426/nazvany-cheshskie-tseny-novykh-iphone-17",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The American company Apple has announced the official prices for the models of the new iPhone 17 smartphone lineup in the Czech Republic. The presentation of the devices took place on Tuesday, September 9, at the company's headquarters in Cupertino.",
        "The cheapest model of iPhone 17 with 256 GB of internal memory will cost brand fans 22,990 kronor.",
        "The most expensive modification of the iPhone 17 Pro Max with two terabytes of memory on board costs 58990 kroner.",
        "The sales of the new products in the republic will start on September 19, 2025 simultaneously with the rest of the world. Pre-orders will be accepted at the official Czech online Apple store starting on September 12 at 2:00 PM.",
        "Externally, the basic iPhone 17 has hardly changed. Like its predecessor, it is available in five colors: black, white, green, blue, and purple.",
        "The smartphone received an updated 6.3-inch OLED display with ProMotion feature and a refresh rate of 120 Hz.",
        "The model has also been equipped with a new selfie camera - now it is an 18 MP square sensor instead of the usual rectangular one at 12 MP. On the back panel, there are no changes - a dual main camera at 48 MP + 12 MP.",
        "The performance of the iPhone 17 is powered by the new Apple A19 chip with a 6-core CPU (2 high-performance cores and 4 energy-efficient cores) and a 5-core GPU.",
        "Developers claim that it is 20% more powerful than the Apple A18 installed in the iPhone 16.",
        "The absolute novelty of the presentation was the ultra-thin iPhone 17 Air smartphone.",
        "This is the thinnest phone in Apple's history. It has a thickness of only 5.6 mm. The 6.5-inch display supports ProMotion with a refresh rate of up to 120 Hz, as well as the Always-On Display feature and a peak brightness of up to 3000 nits.",
        "The body is made of titanium, and the new Ceramic Shield protective glass with nanocrystals promises triple protection against scratches.",
        "The smartphone is equipped with the C1X modem, which is twice as fast as its predecessor and consumes 30% less energy.",
        "The iPhone Air only works with an eSIM, which allowed for increasing the internal space for the battery. The new battery provides up to 40 hours of video playback when connected to a MagSafe pack. The company promises that in active daily use, the charge will last for a whole day.",
        "The display has a diagonal of 6.5 inches with the latest Ceramic Shield 2 protection and ProMotion support (120 Hz).",
        "The main camera on the Air is 48 MP. Users will be able to shoot with four focal lengths (13, 26, 28, and 35 mm) and dual shooting mode (1x and 2x).",
        "Front camera - 18 megapixels with Center Stage feature.",
        "The smartphone is equipped with a new A19 Pro processor with a 6-core CPU, improved GPU with Dynamic Caching, and neural accelerators. Apple says that the chipset provides performance on par with the MacBook Pro.",
        "Apple also introduced the flagship models iPhone 17 Pro and Pro Max with updated design and record-breaking performance. They provide up to 40% more stable operation compared to the iPhone 16 Pro.",
        "Smartphones now feature an aluminum body with high-performance antennas and a new heat dissipation system through the solid body, while the rear glass, thanks to Ceramic Shield, has become four times more resistant to cracks.",
        "The iPhone 17 Pro features three 48MP Fusion cameras on the back panel and an 18MP front camera with Center Stage technology. The camera is equipped with 1x, 2x, 4x, and 8x telephoto lenses, and digital zoom reaches up to 40x for photos.",
        "iPhone 17 Pro and Pro Max are available in three colors: silver, deep blue, and cosmic orange.",
        "The iPhone 17 Pro Max promises the user a record-breaking battery life among iPhones - up to 39 hours of video playback.",
        "You can view detailed technical specifications of the new iPhone 17 on the manufacturer's official website here.",
        "❗️❗️ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}