{
    "url": "https://www.vinegret.cz/708517/prezident-chekhii-podpisal-zakon-ob-uzhestochenii-migratsionnykh-pravil/",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Thursday, August 21, the President of the Czech Republic, Petr Pavel, signed amendments to the asylum law (zákon o azylu) and the law on the stay of foreigners (zákon o pobytu cizinců). The new rules will come into effect in January 2026.",
        "The document was developed by the Ministry of Internal Affairs of the Chechen Republic. It will allow the authorities to deport illegal migrants who abuse the system more quickly and efficiently.",
        "Three offenses and go home",
        "Among other things, the new law provides for the possibility of canceling or not extending a foreigner's residence permit if he commits administrative offenses three times in a row within 12 consecutive months that are subject to inclusion in the register of offenses.",
        "The focus is primarily on violations of public order, civil coexistence, and property rights, such as petty theft in stores, causing harm to health, gross violence, or using pyrotechnics at sporting events.",
        "The Ministry of Internal Affairs will be able to cancel or not extend long-term visas over 90 days or permits for long-term residence (povolení k dlouhodobému pobytu) for problematic migrants in a simplified manner, including the blue card.",
        "This measure will not affect individuals with temporary protection status, permanent residency permit holders (trvalý pobyt), and citizens of the European Union.",
        "The explanatory note only mentions foreigners from third countries.",
        "\"First of all, in the industrial zones (Pilsen, Kralovehradecky, Liberecky, Pardubicky, and Central Bohemian regions) and major cities where there is an increased concentration of foreigners from third countries, demands have been repeatedly voiced from various sides (regional authorities, municipalities, citizens) to address the situation where foreigners commit repeated offenses in the areas of public order, civil coexistence, and property without any consequences for their stay.\"",
        "The discussion is about so-called repeat offenders. An expert working group has been dealing with the situation with them for a long time, as well as solving problems related to the employment of foreigners in industrial zones.",
        "The existing law on the stay of foreigners allows for the annulment of a residence permit in case of non-compliance with the conditions of its issuance or the commission of a serious criminal offense, but this instrument is difficult to apply to recidivism of offenses.",
        "Given the established conditions, the new basis for non-extension or cancellation of stay cannot threaten the employment policy of foreigners in the Czech Republic. On the contrary, it will allow for targeted punishment of only truly problematic foreigners,\" the explanatory note says.",
        "⚠️ The term \"азыл\" (asylum) mentioned in the text refers to a separate residency status, not related in any way to the temporary protection program for Ukrainian military refugees.",
        "What other innovations does the signed law contain?",
        "- In case of an administrative decision on the deportation of a foreigner, they will no longer be able to apply for asylum. Today, some migrants use this opportunity to legally stay in the Czech Republic for several more years after formal deportation while their asylum application is being considered.",
        "- The denial of asylum and the decision to return the foreigner to their country of origin will be considered within the framework of a single administrative case.",
        "- Czech Republic will no longer consider requests for asylum from foreigners deported from other EU member states.",
        "Czech courts, when sentencing a foreigner for a criminal offense, will be obliged to consider the possibility and expediency of deportation as a punishment.",
        "- The authorities will be able to assign a place of residence to asylum seekers or prescribe mandatory stay in special temporary accommodation centers.",
        "- Asylum seekers will be required to undergo a new epidemiological screening.",
        "Restricting the freedom of asylum seekers will become easier.",
        "© 2014-2025 vinegret.cz"
    ]
}