{
    "url": "https://www.vinegret.cz/708891/v-chekhii-prokommentirovali-rossiiskii-udar-po-kievu",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On the night of Thursday, August 28, the Russian Armed Forces carried out a massive airstrike on Ukraine, using 598 combat drones of the \"Shahed\" type, 2 aeroballistic missiles X-47M2 \"Kinzhal\", 9 ballistic missiles \"Iskander\", as well as 20 cruise missiles X-101.",
        "This was reported by the press service of the Ukrainian Air Force.",
        "\"As of 09:00, the air defense has shot down/suppressed 589 aerial targets. Hits of missiles and strike UAVs have been recorded at 13 locations, with the debris of the downed objects falling at 26 locations,\" the military message says.",
        "Under fire, Kyiv was also hit. Numerous civilian objects were damaged in the Darnytskyi, Dniprovskyi, Solomianskyi, Shevchenkivskyi, Holosiivskyi, Obolonskyi, and Desnianskyi districts.",
        "KYIV\n\nMoment of impact of a Russian missile in the Ukrainian capital. pic.twitter.com/rmVoxoTIkg",
        "In the Darnytskyi district, a ballistic missile hit a residential five-story building. As a result, an entire entrance collapsed. Rescuers are working at the scene.",
        "In this area, other residential buildings were also damaged. In particular, fragments of the UAV fell on the roof of a 9-story building. A 16-story residential building, a private house, a parking lot, and a kindergarten were also damaged.",
        "According to the latest information, 17 people were killed in Kyiv as a result of the Russian attack, including four children (among them a 2-year-old girl, a 14-year-old boy, and a 17-year-old girl).",
        "About 40 people were injured, including 10 children.",
        "\"This is a terrible and deliberate killing of peaceful civilians. The Russians are not seeking to end the war, but only launching new strikes. Overnight in Kyiv, dozens of buildings were damaged: residential houses, office centers, civilian enterprises. Among them is also the building housing the representation of the European Union in Ukraine.\"",
        "It is crucial right now for the world to react decisively. Russia must stop this war that it started and continues. New tough sanctions are necessary for Russia's refusal to agree to a ceasefire and its constant attempts to evade negotiations. Only this can work. Russians only understand strength and pressure. For every strike, Moscow must feel the consequences,\" said Ukrainian President Volodymyr Zelensky.",
        "Russian strike on Kyiv was reacted to by Czech politicians",
        "\"Today's brutal attack on Kyiv is a disgusting display of Russia's disregard for peaceful negotiations. Russian missiles have struck several buildings, including the EU representation. Shame on the aggressor. Sincere condolences to the families of the victims. Czechia will continue to support Ukraine,\" wrote the Minister of Foreign Affairs of the Republic Jan Lipavsky.",
        "\"At night, as a result of the Russian attack on Kyiv, innocent people, including children, were once again killed. Is this the same peace that Putin supposedly wants to achieve?\"",
        "It is once again confirmed that only a strong Ukrainian army can resist Russian barbarism, this is in the interests of the security of the whole of Europe.",
        "\"I wish the Ukrainians a lot of strength,\" wrote the Prime Minister of the Czech Republic, Petr Fiala.",
        "\"This is the Russian world in practice: rockets and drones falling on Kyiv, dead children, injured civilians. True peace can come as soon as tomorrow - when the criminal Putin withdraws Russian troops from Ukraine. His fake negotiations are nothing but a cynical trick - he wants to destabilize, weaken, exhaust, and ultimately steal a part of another country.\"",
        "\"All those who think that this is how those who want peace act should quickly wake up from their naive dream. Children were dying in Kyiv today.\"",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}