{
    "url": "https://www.vinegret.cz/709440/es-nachnet-vzimat-20-evro-za-bezvizovyi-vezd-v-shengenskuiu-zonu/",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The European Union is preparing to introduce a system of advance electronic registration for citizens of countries with which it has visa-free agreements. In order to enter the Schengen Zone, they will have to fill out a form in advance on a special website and pay a fee of 20 euros for three years.",
        "The new system has been named ETIAS (EU travel information and authorisation system). Its development began after the terrorist attacks in France and Belgium in 2015 and 2016 with the aim of preventing similar attacks in the future.",
        "The launch has been postponed several times due to technical issues. The new deadline is set for the fourth quarter of 2026, but the exact date is not yet known.",
        "The system is aimed at strengthening the security of the external borders of the European Union by controlling the crossing of the border by citizens of third countries who do not require visas for short stays of up to 90 days within a 180-day period.",
        "It will allow to determine whether the presence of a particular person on the territory of EU member states poses a threat to illegal immigration, security, or public health protection.",
        "The electronic registration will cost 20 euros and be valid for three years with the possibility of multiple entries during this period.",
        "So, filling out the form and paying the fee will only be required once every three years. However, it is worth noting that the registration will be canceled if the expiration date of the passport or its loss occurs. In that case, you will have to go through the procedure and pay the fee again.",
        "It should be noted that initially the fee was set at 7 euros, but in July 2025 it was revised upwards to 20 euros.",
        "\"The increase is aimed at covering operational expenses taking into account the inflation since the establishment of the previous fee and expanding the functional capabilities of the system. This will also bring the fee in line with other similar travel authorization programs, such as ETA in the UK and ESTA in the USA,\" explained the European Commission its decision.",
        "Applicants under 18 and over 70 years old, as well as family members of EU citizens and family members of citizens of non-EU countries who have the right to free movement within the European Union, will be exempt from paying the fee.",
        "Holders of Schengen visas, residence permits, permanent residence permits, and passports of EU member states do not need to register in the system and pay a fee.",
        "What will they ask during online registration?",
        "According to the creators of the system, obtaining the document will take no more than ten minutes. In addition to the usual personal data and information about the place of residence, the applicant will have to provide information about their health status, criminal record, deportations, and presence in conflict zones.",
        "For further effective processing of the collected data, migration authorities of individual EU countries will be granted access to numerous databases of European agencies, such as Europol.",
        "Citizens of which countries will have to undergo registration in the ETIAS system?",
        "The innovation will affect citizens of 59 countries who are allowed visa-free entry into the European Union.",
        "Here is the full list of them:",
        "For trips to which countries will registration in the ETIAS system be required?",
        "You will have to go through the procedure before visiting all 29 countries of the Schengen Zone, as well as Cyprus.",
        "Additional information and answers to the most frequently asked questions about the ETIAS system can be found on the official EU website.",
        "❗️❗️Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}