{
    "url": "https://www.vinegret.cz/709457/v-chekhii-muzhchina-vystrelil-sluchainoi-prokhozhei-v-golovu-priniav-ee-za-shpionku/",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "Last week in the Czech city of Brno, a terrible incident occurred. A man shot an elderly woman in the head with a handgun, whom he did not know, as she was simply walking down the street. This was reported by the police press service on Wednesday, September 10th.",
        "The incident itself occurred on September 2nd in the afternoon in the urban part of Královo Pole.",
        "Despite the extremely serious injury, the victim survived and managed to call her relatives before losing consciousness, who then called an ambulance. Currently, the patient is receiving treatment in the hospital.",
        "The forensic experts immediately began to investigate the circumstances of the incident - questioning witnesses, reviewing surveillance cameras, and examining the crime scene. They were able to track down the shooter on the third day of the investigation when information about an abandoned revolver found in the Znoymo area appeared in the police system.",
        "Among the metal scrap, an employee of the scrap metal collection point discovered it and reported the finding to his supervisor, who then informed the police.",
        "\"The investigators went to the scene and determined that the revolver among the metal scrap was left by the driver of the company who brought the waste to the collection point. After that, the investigators were able to quickly locate and apprehend the 36-year-old suspect. He was incriminated, in part, by recordings from street surveillance cameras,\" said police representative Pavel Shvab.",
        "During the interrogation, the detainee confessed to the crime and expressed remorse. He admitted to acquiring and illegally possessing a gun.",
        "\"The suspect said that he noticed a woman and came to the conclusion that she is an agent of a foreign state. He was afraid that she was engaged in criminal activities and posed a threat to his life. His fear seems to have been exacerbated by the fact that he had not been taking his prescribed medication for a long time,\" Shvab added.",
        "The detainee has been charged with attempted murder and illegal possession of weapons. He faces up to 20 years in prison. The court has ruled to remand the man in custody.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}