{
    "url": "https://www.vinegret.cz/705859/praga-nachala-poisk-glavnoi-rozhdestvenskoi-elki-za-pomoshch-obeshchaiut-nagradu",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "It's June 16th, and in Prague they are already concerned with finding the main Christmas tree, which will be installed in November at the Old Town Square in the very center of the city. A cash reward of 10,000 crowns is promised for information on where a suitable coniferous beauty grows in terms of height and shape.",
        "The competition is being held for the fifteenth time by the company Taiko, which organizes Christmas markets on the Old Town and Wenceslas Squares upon the request of the city hall. Anyone who wishes can participate in it. To do this, it is enough to send a photo of a Christmas tree and its location coordinates to the email info@taiko.cz.",
        "The company is specifically looking for a common fir tree with a height of 23-25 meters (the trunk will then be shortened to 22 meters), with a straight healthy trunk and evenly wide branches. The tree can grow both on private property and in a public place. The main thing is that it is easily accessible for heavy machinery.",
        "The company advocates for a responsible attitude towards nature. Therefore, the tree that is more likely to become the main symbol of Christmas is the one that will be cut down soon anyway, but for a different reason. For example, if it has grown so much that it poses a safety threat to people in windy weather, or if it is growing on private property where construction work is planned.",
        "The competition will last until September 15th. The results will be announced by November 3rd.",
        "In 2025, the solemn ceremony of lighting the Christmas tree on the Old Town Square will take place in the evening on Saturday, November 29. On the same day, the largest Christmas market in the city will open there. It will be open until January 6, 2026.",
        "You can admire the main Christmas tree of Prague from last year and refresh colorful memories here.",
        "❗️❗️Subscribe to our Telegram channel at the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}