{
    "url": "https://www.vinegret.cz/699779/strakh-pered-podorozhaniem-nedvizhimosti-gonit-zhitelei-chekhii-v-banki",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The demand for buying own housing in the Czech Republic almost ignored the seasonal factor and remained high at the beginning of 2025. Along with developers and real estate agencies, this is confirmed by banking statistics. In January, they issued 4764 new mortgages totaling 18.7 billion crowns. This is 5% less than in December, but 72% more compared to January 2024.",
        "On Monday, January 17, the Czech Banking Association (ČBA) published such data in its report Hypomonitor. The research takes into account the statistics of all banks and savings banks issuing housing loans in the republic.",
        "The average mortgage rate in January was 4.78%.",
        "This is 0.02% less compared to December, and 0.74% less on a year-over-year basis.",
        "At the same time, the average size of the mortgage issued in January was 3.92 million kroner.",
        "In one month, it grew by 2%, and in one year - by 15% (in January 2024, the average size of a mortgage loan was 3.41 million crowns).",
        "\"Despite the fact that a significant decrease in the number and volume of new mortgages is typical for January, this is definitely not the case this year, and we are witnessing a promising start to the new mortgage year. Based on current data, the first quarter could bring a significant revival to the market, as people are becoming more actively involved in solving the issue of their own housing, and a moderate decrease in interest rates could support their decision,\" said Zdenka Kovarzhova, manager of mortgage loans and consumer financing at UniCredit Bank.",
        "The average monthly mortgage payment has decreased slightly - by a few hundred crowns. For a loan of 3.9 million crowns, issued for 30 years at an average interest rate of 4.78%, it amounted to 20,541 crowns in January.",
        "In the entire year of 2024, the total volume of issued mortgages amounted to 228 billion crowns, which is 83% higher compared to 2023. If the dynamics of the last three months continue, then by the end of 2025, the volume of new mortgage loans could reach 267 billion crowns, indicating a 17% growth year-on-year.",
        "\"The behavior of households shows how closely they are monitoring the real estate market situation. Prices for apartments and houses accelerated their growth last year, which, given the limited supply of new projects, may continue into 2025. Clients are speeding up their decisions on new housing, as delaying a purchase in the coming months in anticipation of lower interest rates could ultimately prove more costly. Therefore, even in the typically weak January, interest in mortgages remained, and sales volumes were good,\" noted Martin Vashek, CEO and Chairman of the Mortgage Division of ČSOB Bank.",
        "❗️❗️Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}