{
    "url": "https://www.vinegret.cz/708937/v-chekhii-vynesli-prigovor-ukraintsam-zavozivshimi-psevdobezhentsev-iz-ukrainy-radi-posobii",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Wednesday, August 27, the Regional Court in Brno found two Ukrainian citizens, Ivan Savarin and Kristina Savchin, guilty of large-scale fraud. They deceived the Czech state out of 11 million crowns by abusing a financial aid program for military refugees.",
        "\"The entrepreneurs\" organizedly brought their compatriots to the Czech Republic on minibuses, arranged temporary protection for them based on fake residence confirmations, opened bank accounts in their names, and applied for humanitarian aid, after which they took them back to Ukraine.",
        "Then the criminals would withdraw money from ATMs, pay a portion to the pseudo-refugees for their participation in the scheme, and keep the majority for themselves to spend on personal needs. Investigators were unable to trace exactly where the money went.",
        "The accused were running such a simple and cynical scam for 11 months, receiving a total of 830 humanitarian aid payments. Moreover, in the last few months, the couple's appetites grew, and the intensity of bringing in people increased.",
        "As a result, the court sentenced the foreigners to 4 years of imprisonment. After serving their sentence in a Czech prison, they will be deported from the country with a subsequent 5-year ban on entry. In addition, the court ordered them to compensate for the damage caused.",
        "The Ukrainians admitted their guilt and expressed remorse. They have already compensated for part of the damage. Their family (including their grandmother and aunt) helped them raise 2.5 million crowns, as reported by the iDNES portal.",
        "In addition, immediately after the arrest, the fraudsters' bank accounts, cash, and a car in personal ownership were seized, which will now be transferred to the state. The total amount of seized funds amounted to 2.5 million crowns. In other words, in total, the fraudsters have already returned almost half of the stolen 11 million crowns.",
        "Admitting guilt and efforts to rectify the situation resulted in the accused receiving a more lenient sentence. Initially, they were facing up to 10 years in prison.",
        "Savarin works as a customs officer in his homeland, while Savchin is a primary school teacher, also working part-time as a fitness trainer in her free time.",
        "They constantly lived in Ukraine, visiting the Czech Republic only for business trips. Law enforcement officers detained the fraudsters as they were returning home after another visit. They had 74 bank cards and 12 mobile phones confiscated, which were used to manage bank accounts.",
        "During the investigation, the man tried to take all the blame upon himself, while the woman claimed she had nothing to do with what had happened. However, she later confessed to being an accomplice. Savarin continued to insist that he was the mastermind behind the fraudulent scheme and the main responsibility lay with him. In court, he spoke in Czech.",
        "\"I'm the one who dragged my partner into this, she definitely doesn't bear the same guilt. I will forever blame myself for this. I can only hope for a shorter sentence for my partner so that she can return to her daughter as soon as possible,\" he said during the hearing.",
        "However, the court considered that the guilt of both foreigners is equal.",
        "\"After admitting guilt, it is impossible to delve into details of who exactly did what. It cannot be assumed that the accused was only accompanying someone on trips from Ukraine to the Czech Republic and back,\" explained Judge Martin Vrbik.",
        "The defendants' lawyer tried to obtain a suspended sentence, but the court deemed it impossible.",
        "\"In Ukraine, there are people whose lives are in danger, and the Czech Republic voluntarily helps them. However, this has caused social tension in society, which the couple definitely exacerbated with their activities,\" Vrbik added.",
        "The verdict rendered is not final. The parties have taken time to consider whether they will file an appeal.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}