{
    "url": "https://www.vinegret.cz/708419/gde-v-prage-gotoviat-deistvitelno-vkusnye-sushi-nash-obzor-imperial-sushi",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "In Prague, there is an immense number of restaurants of all formats, styles, and cuisines. However, it is surprisingly difficult to find a place where they prepare truly delicious and high-quality sushi.",
        "Through our many years of gastronomic experience, full of trials and disappointments, we have visited dozens of establishments in the editorial office and have come to the conclusion that worthy sushi restaurants can be counted on the fingers of one hand.",
        "Among them is Imperial Sushi.",
        "The company opened in March 2020, right before the start of the coronavirus pandemic. Initially, it operated only for delivery, but now the company has two restaurants in Prague (Žižkov, Stodůlky) and a bistro in Pilsen.",
        "Yes, this is an advertisement article, but we really like the local sushi, so we decided to write it in the format of a personal opinion.",
        "The restaurant in the Žižkov area (Vlkova 539/7) opened a month ago after a large-scale reconstruction.",
        "Now he has a modern and stylish interior with a bar counter and a separate room, which can be separated by a partition for family celebrations or private events.",
        "High-quality and comfortable furniture, expensive tableware and utensils, responsive staff (employees speak Ukrainian, Russian, Czech, and English languages).",
        "In every sense, a pleasant atmosphere. The place is perfect for both a date and meeting with friends.",
        "The menu includes several Asian soups (miso, tom yum), ramen, sashimi, salads, traditional Japanese dishes, a total of 12 types of poke bowls, and a wide variety of sushi.",
        "The beer selection includes draft \"Pilsner\", canned non-alcoholic \"Birel\", and Japanese Asahi in bottles.",
        "In the reviews, the restaurant is praised for its delicious cocktails and homemade lemonades, but we didn't try them - as usual, we opted for beer.",
        "We went to a sushi restaurant and ordered several unusual and classic types from the extensive menu.",
        "Mango Philadelphia Roll (399 kroner) - with salmon, mango, cream cheese \"Philadelphia\" and mango mayonnaise.",
        "If you like to try new and unusual combinations, then this is the option for you:",
        "The prices cannot be called low, but here they are more than compensated by the highest quality of sushi rolls.",
        "The portions are large, the fish is fresh and there is a lot of it. With each bite, you can feel the taste and texture of the fish, which complement the other ingredients. However, the rice remains in the background, as it should be.",
        "True pleasure from food justifies the price. In any field, quality costs money - that's how the economy works.",
        "Dragon-Roll (389 kroner) - with eel, avocado, crab cream, cucumber, and eel sauce.",
        "We really love eel rolls. And it's no exaggeration that they are the best we have tried in Prague.",
        "Beauty!",
        "Tuna truffle roll (419 kroner) - with tuna tataki, avocado, cucumber, Chinese cabbage pak-choi, truffle mayonnaise, and wasabi-ponzu sauce.",
        "Another fusion roll that we haven't tried before. Very delicious. I think we liked it the most.",
        "Fuji tempura roll (389 kroner) - with tuna, salmon, avocado, tobiko caviar, fried in tempura batter, and served with signature sauces.",
        "Rainbow roll (369 kroner) - with tuna, salmon, shrimp, eel, tobiko caviar, crab cream, cucumber, and avocado.",
        "The sushi rolls look beautiful, but the taste of this mix seemed questionable to us.",
        "Philadelphia (329 crowns) - with salmon, cucumber, avocado, and Philadelphia cream cheese. Impeccable classic.",
        "Hosomaki unagi (169 kroner) - hosomaki with eel.",
        "Nigiri unagi (99 kroner) - nigiri with eel.",
        "Nigiri tobiko (79 kroner) - nigiri with tobiko caviar.",
        "Imperial Sushi offers delivery in Prague and Pilsen (within 60 minutes).",
        "You can place an order on the website: https://rozvoz.imperialsushi.cz/",
        "📍 Restaurant addresses:",
        "In the Žižkov district: Vlkova 539/7, Prague 3, Žižkov",
        "In the Stodulky area: Hábova 2345/7, Prague 13, Stodůlky",
        "👉 You can reserve a table using this link: https://imperialsushi.cz/pobocky/",
        "© 2014-2025 vinegret.cz"
    ]
}