{
    "url": "https://www.vinegret.cz/708803/pravitelstvo-ukrainy-razreshilo-muzhchinam-do-22-let-vyezd-za-granitsu",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Tuesday, August 26, the Ukrainian government supported the proposal of President Volodymyr Zelensky and allowed men up to 22 years old to freely travel abroad during the martial law. This was announced by Prime Minister Yulia Sviridenko.",
        "\"Today the government updated the rules for crossing the state border. Men aged 18 to 22 will be able to cross the border freely during a state of emergency. This applies to all citizens of the corresponding age.\"",
        "This decision also applies to citizens who, for various reasons, find themselves abroad. We want Ukrainians to maintain strong ties with Ukraine as much as possible. The changes will come into effect the day after the official publication of the resolution,\" she wrote in her Telegram channel.",
        "In turn, the Minister of Internal Affairs of Ukraine, Igor Klymenko, stated that the main goal of this step is to provide young Ukrainians with broader opportunities for education, internships, and legal employment abroad so that they can later use the experience gained for the development of Ukraine.",
        "\"Today the government has adopted changes to the Rules for crossing the state border by citizens of Ukraine. The corresponding resolution was prepared by the Ministry of Internal Affairs.\"",
        "This decision implements the task of the President of Ukraine and opens up new opportunities for our youth. Men aged 18 to 22 inclusive will have the right to cross the state border freely during the period of martial law.",
        "\"We are doing our best to ensure that Ukrainian youth have access to quality education and international experience, while remaining a strong part of our state,\" wrote the head of the Ministry of Internal Affairs on social media.",
        "Let's remind you that since the beginning of the full-scale Russian invasion of Ukraine, martial law has been in effect. As of February 24, 2022, the majority of men aged 18 to 60 with Ukrainian citizenship are prohibited from leaving the country. Exceptions are made for people with disabilities, fathers of many children, volunteers, and several other categories.",
        "At the same time, men under the age of 25 are not subject to mandatory mobilization and cannot be drafted into the army.",
        "In early August 2025, the President of the country, Volodymyr Zelensky, spoke at the Ukrainian Youth Forum, where he told students that he had instructed the government to explore the possibility of simplifying border crossings for Ukrainians aged 18 to 22.",
        "❗️❗️Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}