{
    "url": "https://www.vinegret.cz/704833/nashumevshii-ukrainskii-spektakl-konotopskaia-vedma-pokazhut-v-prage",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The most popular Ukrainian play of recent years, \"The Witch of Konotop\" (Конотопська відьма) directed by Ivan Uryvsky, will be shown in Prague. The performance will take place on September 17, 2025, at the Hybernia Theatre.",
        "👉 Tickets can be purchased through this link.",
        "The play was brought to Prague for the first time in January. The demand was so high that the organizers had to add a second performance. Tickets are still available for sale now, but there are very few left.",
        "The play \"The Witch of Konotop\" was staged based on the story by Hryhoriy Kvitka-Osnovyanenko in Kyiv in 2023. The premiere took place at the Ivan Franko National Academic Drama Theater.",
        "The performance combines elements of Ukrainian folklore and mysticism with contemporary socio-political issues. The play challenges traditional stereotypes about witches, resonating with themes of female power, independence, and equality. It also addresses fears and prejudices, historical persecution, and oppression of women, particularly in the context of societal and social norms. The director of the play has chosen an innovative approach, blending authentic Ukrainian traditions with modern theatrical methods and styles.",
        "\"The play dramatizes the story of a Cossack leader in Ukrainian society almost 400 years ago, as he tries to eradicate witches who the locals believe are responsible for the drought. The action takes place against the backdrop of a military threat from Tsarist Russia - something that resonates with today's Ukrainians as they hear daily news from the front lines and prepare for missile strikes from modern Russia on their cities at night,\" wrote a reviewer for the American magazine The New York Times about the play.",
        "The production uses minimalist set design, where each element of the decorations has a special symbolic meaning, and the stage space is completely filled with the actors' performance, lighting, and sound effects, which captivate the audience.",
        "\"For me, the main theme became the choice between two forces - Light and Darkness. These are global concepts, but the choice can be much more extensive and diverse. The story includes a love story and a sense of inevitable war. And many other subthemes that resonate with our own issues. The work contains many meanings - political, existential, spiritual.\"",
        "\"It is very difficult to outplay the harsh reality in which Ukrainians are currently living, but the theater must feel the mood of the times and the people. When this is achieved, then the performance will touch the hearts of people,\" noted the director Ivan Urovsky.",
        "🕗 When: September 17, 2025 (Wednesday) at 7:00 PM;",
        "📍 Where: Divadlo Hybernia, Náměstí Republiky 3/4, Prague 1, New Town;",
        "🎟 Tickets can be purchased at this link.",
        "🗣 Play in Ukrainian language.",
        "❗️❗️Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}