{
    "url": "https://www.vinegret.cz/645840/u-posolstva-rossii-v-prage-proidet-aktsiia-v-podderzhku-memoriala",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Monday, December 13, there will be a rally in support of the historical, educational, human rights, and charitable organization \"Memorial\" in front of the Russian Embassy in Prague. The Russian authorities are trying to shut it down through the court under the pretext of violating the foreign agents law.",
        "At 5:00 PM, activists will gather at Boris Nemtsov Square (Náměstí Borise Němcova) and symbolically light the candles and lanterns brought by them (a candle is a symbol of \"Memorial\"). Everyone who wishes to participate in the event is invited to join.",
        "The organizers are the public associations Kulturus, Gulag.cz, and Memorial Czech Republic. Additional information can be found at this link.",
        "Let's note that \"Memorial\" has been operating in Russia since 1989. The organization's activities are aimed at uncovering and disseminating information about the crimes of totalitarian regimes of the 20th century, rehabilitating the repressed, and providing assistance to their families.",
        "According to the Charter of the organization, \"Memorial\" sets the following goals:",
        "- promoting the development of civil society, legal awareness of citizens, and a democratic rule of law state to prevent a return to totalitarianism.",
        "- assistance in popularizing democratic values and affirming human rights;",
        "- Commemoration of the memory of the victims of political repression and restoration of historical truth.",
        "The General Prosecutor's Office of the Russian Federation has identified in the activities of the organization \"psychological and linguistic signs\" of justifying terrorist organizations and \"approving extremism,\" as well as seen a direct public threat. Based on the conclusion of its experts, the prosecutor's office filed a lawsuit in court for the liquidation of \"Memorial.\"",
        "Many international human rights organizations, including Amnesty International, Civil Rights Defender, Human Rights Watch, and the European Center for Human Rights Protection, have expressed support for the society. Several hundred cultural figures from different countries have composed and signed an open letter in defense of the organization. Among them are Stephen Fry, Tom Stoppard, Oleg Basilashvili, Leonid Parfyonov, Chulpan Khamatova, Andrey Bilzho, and many others.",
        "An open letter in support of \"Memorial\" was composed and signed by 45 Czech senators, as well as the chair of the Chamber of Deputies, Marketa Pekarova-Adamova.",
        "\"The ongoing persecutions and harassments of human rights defenders and independent historical organizations in Russia, including attempts to liquidate them, are unacceptable to us, and we call for an immediate end to this,\" the letter says.",
        "Subscribe to our Telegram channel, where the news comes out faster.",
        "© 2014-2025 vinegret.cz"
    ]
}