{
    "url": "http://www.vinegret.cz/701049/pravitelstvo-chekhii-odobrilo-usloviia-spetsialnogo-vnzh-dlia-ukrainskikh-bezhentsev",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Wednesday, March 19, the Czech government approved a resolution developed by the Ministry of the Interior, which sets out the requirements for Ukrainian refugees who wish to switch from a temporary protection visa to a special type of long-term residence permit (zvláštní dlouhodobý pobyt, special long-term residence permit). Among these requirements is financial self-sufficiency.",
        "From the approved resolution, it follows that in order to switch to a special long-term residence permit, the applicant's total \"gross\" income (roční hrubý úhrnný příjem) must be at least 440,000 crowns per year.",
        "If other family/household members apply for a special residence permit along with him as part of the same case, the income of each subsequent member must be at least 110,000 crowns per year.",
        "Important notes:",
        "1) This refers to the annual total income, which does not necessarily have to be evenly distributed across months. Therefore, it is possible that the applicant will reach the specified amount in a shorter period than one year, or through a combination of multiple sources of income. The monthly income in the table is provided only as an approximate and most common indicator.",
        "2) The income level is calculated for the entire family/household as a whole. This means that in the case of a family \"husband + wife + 2 children,\" the combined annual income of the parents should also cover the needs of the children. In other words, together they should demonstrate an income of 770,000 crowns per year for the whole family.",
        "3) Humanitarian assistance will not be considered as income. On the contrary, only refugees who did not receive humanitarian assistance during the period from October 1, 2024, to March 31, 2025, will be able to apply for a special residence permit in the first wave. Independence from assistance is a condition for financial self-sufficiency.",
        "4) If any of the refugees currently do not meet any of the requirements, they will be able to apply for a special residence permit later - registration \"waves\" will be conducted regularly (the frequency and specific dates will be determined by the government).",
        "It will be difficult to confirm income for self-employed individuals in lump-sum taxation.",
        "Ukrainian refugees who are engaged in private entrepreneurial activities (OSVČ) under a lump-sum tax regime (paušální daň) find themselves in a very disadvantageous position.",
        "If such an entrepreneur pays a single tax at the most popular first rate (I. pásmo, in 2025 it is 8716 crowns per month), then the Ministry of Internal Affairs recognizes only 224880 crowns as his annual income. In the case of the second rate, the recognized income will be 336600 crowns, and in the case of the third rate - 514800 crowns.",
        "In other words, in the first two cases, the recognized income will not be enough to obtain a special residence permit (for this, the annual income must be at least 440,000 crowns). The Ministry took this step consciously, as the lump-sum regime is extremely opaque in terms of confirming the entrepreneur's actual income.",
        "\"It should be noted that the income will be sufficient only if the applicant is registered in the third zone of the lump-sum taxation regime. For foreigners registered in lower zones, additional income will be required either from themselves or within the household to reach the amount required by the resolution,\" - as stated in the explanatory note to the document.",
        "From the above, it follows that a much more advantageous option for confirming income would be official employment with a \"gross\" salary of at least 36,667 crowns per month or the classic tax regime OSVČ with the submission of a tax return at the end of the year.",
        "Besides financial requirements, there are also other demands.",
        "For example, the applicant must:",
        "- to live in the Czech Republic for at least two years with temporary protection status;",
        "- to have a valid international passport;",
        "The transition process will begin in April.",
        "© 2014-2025 vinegret.cz"
    ]
}