{
    "url": "https://www.vinegret.cz/709139/v-chekhii-pensionerka-zabyla-v-magazine-krupnuiu-summu-prodavets-vse-vernul-i-otkazalsia-ot-nagrady",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "An elderly resident of the Czech city of Pardubice withdrew her savings from the bank and on her way home stopped by a small grocery store on Prospekt Mira. Due to a momentary lapse of attention, she forgot an envelope on the counter, which contained 100,000 crowns, her identification card, and a bank statement.",
        "The pensioner was very lucky that an honest person - the owner of the store, who is also a seller, found the lost item. He did the right thing by immediately calling the municipal police.",
        "The arriving patrol officers documented the fact of receiving money and returned it to the owner within an hour.",
        "\"The man was probably in shock when he found such a sum, but his reaction was commendable and exemplary. I must say that there are still many honest finders. It is not uncommon for us to receive found expensive smartphones, tens of thousands of crowns forgotten at ATMs, and the like. However, definitely, many findings do not reach us,\" said municipal police representative Jiří Sejkor.",
        "By law, the seller was entitled to 10% of the found amount, which in this case amounts to 10,000 crowns. However, the man refused the reward and agreed only for the patrol officers to reveal his name to the happy pensioner.",
        "\"This case was one of those that were relatively easy to solve because the woman had put documents and a bank statement in the envelope with the money. The patrol officers tried to find her as soon as possible because they were seriously concerned that she might suffer a stroke after realizing such a big loss. We are very happy that we brought her good news,\" Seikora added.",
        "✅ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}