{
    "url": "https://www.vinegret.cz/709300/v-chekhii-zaderzhali-voditelia-formuly-ekhavshego-po-avtomagistrali",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Sunday morning, September 7th, the Czech police detained the driver of a red Formula GP2 car who was racing recklessly on the D4 highway accompanied by luxury sports cars and a videographer.",
        "It turned out to be a 51-year-old man. This was reported to the Novinky portal by police representative Michaela Richterova.",
        "Apparently, we are talking about the same racing car that has been illegally driving on public roads for the past few years, endangering other motorists.",
        "On Sunday around 08:00, witnesses spotted him in the vicinity of the city of Pribram (Central Bohemian Region) and immediately called the police. The dispatcher sent several patrol cars to the scene and deployed a helicopter into the air.",
        "Soon, law enforcement officers managed to track down the sports car - they ordered the driver to stop, but he refused to comply and tried to escape. In the end, he drove into the yard of a private house in the village of Buk hoping that it would protect him from being detained.",
        "However, the police officers continued to stand their ground, stating that the intrusion onto private property was lawful because it occurred as a result of the driver refusing to stop in a public place. As a result, the racer was detained and taken to the police station for further investigation.",
        "Let's note that the Dallara GP2 race car has a weight of 688 kg and a power of around 620 horsepower. The operation of such cars is allowed only on specially equipped race tracks, and it is strictly prohibited to drive them on public roads. The race car does not have license plates, turn signals, or other safety features.",
        "Not for the first time",
        "For the first time, a red car of the same class and in the same livery was spotted in 2019 on the D4 highway in the same location - between the cities of Dobříš and Příbram. At that time, with the help of the public, the police managed to locate the owner of the racing car - a 45-year-old (at that time) citizen of the Czech Republic.",
        "The man faced a fine of 5 to 10 thousand crowns and a suspension of his driver's license for a period of 6 to 12 months. However, the owner stated through lawyers that he personally did not drive on the highway and did not know who was driving the car at that moment. Since the driver was wearing a racing helmet, the police were unable to identify him, and the case had to be closed.",
        "In 2022, the red sports car was once again spotted on the D4 highway, and in 2023, the daredevil even ventured into Prague - he was seen on the ring road in the company of a yellow \"Formula 3000\" sports car.",
        "A few weeks ago, fresh videos made on the D4 highway by the driver himself and his companions went viral on social media.",
        "Due to the helmet, investigators will now find it extremely difficult to determine who exactly was driving the racing car in previous cases - the detained person or someone else.",
        "After giving testimony, the 51-year-old man was released. His son commented on the situation by stating that the police illegally entered their private property. He also claimed that the racing car was driving at a speed of 180-200 km/h, but was not making sharp maneuvers, and personally he does not understand why a racing car cannot go out on the highway.",
        "\"I know the rules, but there are people driving on the highway who shouldn't be there, and they drive very dangerously. In the USA, everyone can drive whatever they want and however they want, and everything works fine for them,\" said the son of the detained driver.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}