{
    "url": "https://www.vinegret.cz/708482/v-prage-proidet-festival-sveta-signal-2025",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "The annual light festival SIGNAL 2025 will take place in Prague. The event will delight the city residents for four consecutive evenings - from October 16th to October 19th inclusive.",
        "The main part of the festival will once again take place on the streets and squares in the city center and will be completely free. Visitors will be able to freely view 13 light installations, including two video mappings.",
        "The canvases for video projections will be:",
        "- The facade of the Basilica of St. Ludmila on Peace Square (where they will show a video called \"The Endless Rhythm of the City\" by the Spanish studio V.P.M.).",
        "- And for the first time in the 13-year history of the festival, the tower of the Old Town Hall on the square of the same name will also be featured. A video clip of Overlord from the Italian studio MammasONica will be projected onto it.",
        "The shows will take place daily from 7:00 PM to 12:00 AM, constantly repeating with a 15-minute interval.",
        "Seven more art objects, including a wide-format immersive projection, will become part of the paid program Signal INSIDE. It will take place in several indoor locations (churches, galleries, etc.), entry to which will be by tickets.",
        "Tickets for one day (290 kronor), for all four days (390 kronor), as well as VIP tickets (1690 kronor) are available. The VIP ticket allows you to skip the long lines with priority entrance and provides a number of other bonuses.",
        "👉 Tickets are sold on the festival website. There you can also find a detailed description of each art object and their exact location.",
        "Two routes are planned - in the city center and in the Vinogradы district.",
        "An interesting novelty of this year will be a light 3D projection on a \"screen\" made of water mist, which will appear to float in the air. According to the organizers, the effect is reminiscent of a hologram.",
        "Visualizations of some other objects:",
        "Let's note that SIGNAL is one of the most popular annual festivals in Prague. Every year, it is attended by around 500,000 people (you can see a photo and video report on the event in 2024 here).",
        "❗️❗️ Subscribe to our Telegram channel at the following link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}