{
    "url": "https://www.vinegret.cz/709197/mvd-chekhii-vypustilo-videoinstruktsiiu-po-finalnomu-etapu-perekhoda-na-spetsialnyi-vnzh",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Monday morning, September 8th, Ukrainian refugees in the Czech Republic will be able to find out the results of their April applications to switch from temporary protection visa to a special long-term residence permit (zvláštní dlouhodobý pobyt, special long-term residence permit).",
        "This information will appear at 08:00 in the personal account on the Information Portal for Foreigners https://ipc.gov.cz (during the first hours or even days under high load, the portal may work slowly or periodically \"crash\").",
        "❗️ If the \"Compliance with Terms\" tab is not displayed in your profile, please log in again using electronic identification. If you are unable to log in, try again later.",
        "Each individual condition for obtaining a special residence permit will be evaluated separately and marked with one of the following colors:",
        "In case of a positive decision, the applicant will need to go through online registration for the final stage of the transition (a corresponding button will appear in the personal account).",
        "It will open on September 8th at 08:00 and will run until December 31, 2025, inclusive. So, there is quite a lot of time allocated.",
        "The Ministry of Interior of the Czech Republic has released a detailed video instruction for each step of online registration. It is recommended to watch the video before starting the process.",
        "Based on the online registration results, the applicant will know the date and time when they should visit the migration department of the Ministry of Internal Affairs to provide the necessary documents (if required) and undergo the procedure of biometric data collection.",
        "You can read in detail about the final stage of transitioning to a special residence permit here.",
        "⚠️ In case any of the conditions have been assessed in the system as not met (in red color), but you are sure that you meet this condition and an error has occurred, you should contact directly the department that conducted the assessment (Ministry of Labor, insurance company VZP, etc.).",
        "If you believe that several conditions related to the competence of different responsible institutions have been incorrectly assessed, you need to contact each responsible institution separately (more details).",
        "❗️ Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}