{
    "url": "https://www.vinegret.cz/699021/v-prazhskom-grade-vpervye-otkrylas-vystavka-podarkov-prezidentu-chekhii",
    "title": "",
    "meta": {
        "tags": []
    },
    "paragraphs": [
        "On Friday, January 31, an exhibition of protocol gifts received by the President of the Czech Republic from foreign statesmen, representatives of Czech regions, and citizens opened at the Rožmberk Palace in Prague Castle. This was reported by the office of the head of state.",
        "The exhibition with the speaking title \"Gifts for the President from Near and Far\" is being held for the first time and is available to visitors for free. It will be open daily at least until the end of 2025.",
        "- during the winter tourist season from 09:00 to 16:00;",
        "- during the summer tourist season from 09:00 to 17:00.",
        "\"We offer a unique perspective on the role of gifts in the world of diplomacy and traditions of different countries. The range of items that the president receives is truly wide. This spring, we will introduce several interesting novelties, and then we plan to update or supplement the exhibition annually at the beginning of the year so that visitors have a reason to come back.\"",
        "\"These unusual artifacts symbolize the culture, history, and traditions of the countries and regions they come from, and reflect respect, friendship, or a political message. The exhibition features items of high craftsmanship and artistic value, as well as personal gifts, such as children's drawings with sincere wishes,\" said Veronika Volf, the director of the cultural department of Prague Castle.",
        "Among the gifts on display, you can see, for example:",
        "- part of the tank armor with a drawing and the inscription \"Truth prevails\" from the President of Ukraine Volodymyr Zelensky;",
        "- a carved stone with a silver tree and a house on a branch from the President of the Philippines;",
        "- golden decorative plate on a golden stand from the President of the Republic of Angola;",
        "- silver menorah from the state of Israel;",
        "- ceramic plate by Ukrainian artist Rustem Skibin;",
        "- table clock in the shape of a camel by Tamim bin Hamad Al Thani, the Emir of Qatar;",
        "- album with images from the history of the Grand Duchy of Lithuania;",
        "- golden bas-relief from the Ambassador of Kazakhstan, Bakytzhan Dzhussengaliyev;",
        "- a set of silver coins featuring images of Romanian monarchs.",
        "- A casket from the President of the Republic of Korea Yun Sok Yol and Mrs. Kim Kon Hee.",
        "❗️❗️Subscribe to our Telegram channel by following the link: t.me/vinegret_cz",
        "© 2014-2025 vinegret.cz"
    ]
}